import 'Data.dart';

class Healthy {
  int _healthNumber = 0;
  List<Health> _healthBank = [
    Health(
      healthText:
          'نیشانەکانی شەقیقە \n\n ١. بونی سەر ئێشەیەکی توند لەبەشێکی سەر \n\n ٢.هێڵنجدان و ڕشاناوە \n\n ٣.تێکچون بە ڕوناکی زۆر و ژاوەژاو‌ \n\n ٤. بەردەوام بوون و دووبارە بوونەوەی سەر ئێشەی توند   ',
    ),
    Health(
        healthText:
            'گرنگی ژەمی بەیانیان\n\n ١. یارمەتی زیندەچاڵاکیەکانی لەش دەدات\n\n  ٢. ئاستی ئەنسۆلین لە خوێندا ڕێکدەخات \n\n ٣. چاڵاکبوون لە تەواوی ڕۆژەکەدا\n\n ٤. پاراستنی کێشی لەش بە جێگیری'),
    Health(
        healthText:
            'زیانەکانی زۆر نووستن\n\n ١. کەمبوونەوەی وزەی لەش\n\n ٢. گۆشەگیری\n\n ٣. ڕاڕایی \n\n ٤. زیادبوونی کێشی لەش \n\n ٥. کاریگەری خراپی لەسەر یادگە هەیە\n\n ٦. پەیدابوونی ئازاری پشت\n\n ٧. ئازاری سەر'),
    Health(
        healthText:
            'هەنگاوێکی گەورە بەرەو چارەسەرکردنی کوێریی\n\n زانستکارانی میرنشینە یەکگرتوەکان ئاشکرایانکرد کە هەنگاوی گەورە بەرەو ئەگەری چاکبوونەوەی کوێری نراوە، توێژینەوەیەك کە لەسەر ئاژەڵان ئەنجامدراوە و لە بڵاوکراوەی زانستی نەیچەر بایۆتەکنەلۆجیدا بڵاوبۆتەوە، دەریدەخات کە دەکرێت ئەو بەشەی چاو کە هەست بە روناکی دەکات لەرێگەی قەدە خانە چاکبکرێتەوە، تیمێکی پسپۆڕان لە نەخۆشخانەی مورسفیڵدسی چاو و زانکۆی یو سی ئێڵ لە لەندەن رایانگەیاند کە ئەگەری ئەوە هاتۆتە ئاراوە ئەو چارەسەرە بۆ یەکەمجار لە مرۆڤدا تاقیبکرێتەوە، پسپۆڕان ئەم هەنگاوە بە "دۆزینەوەیەکی ئێجگار گرنگ" و "هەنگاوێکی مەزن" لەقەڵەمدەدەن، تیشکوەرگرەکان ئەو خانانەن لە تۆڕیی (الشبکیة) چاودا کە هەستیارن بەرامبەر تیشك و دەیگۆڕن بۆ هێمای کارەبایی کە دەتواندرێت بنێردرێت بۆ مێشک (دەماخ)، بەڵام هەندێكجار ئەم خانانە دەمرن و ئەمەش دەبێتەهۆی کوێربوون، وەك لە حاڵەتی نەخۆشی ستارگاردیتس و پوکانەوەی خاڵی زەردی (ڕماکولا)ی چاو بەهۆی پیریەوە. لەئێستادا تاقیکردنەوە لەسەر مرۆڤ ئەنجامدراوە بۆ بەکارهێنانی قەدە خانە لەجیاتی خانە "پشتیوانەکانی" چاو کە پارێزگاری لە خانە تیشکوەرگرەکان دەکەن بۆ ئەوەی بە زیندوویی بمێننەوە، \n\n مشکی کوێر\nبەگوێرەی تیمە زانستییەکە، دەتواندرێت خانەی هەستەوەری رووناکییەکان بگۆڕدرێن و ئەمەش هیوای چاکبوونەوەی کوێریی زیاددەکات. زانستکاران رێگەیەکی نوێیان بەکارهێناوە بۆ دروستکردنی تۆڕی چاو لە تاقیگەدا، ئەم رێگەیە گیرایەبەر بۆ دروستکردن و کۆکردنەوەی هەزاران قەدە خانە کە دواتر ئامادەکران بۆ گۆڕینیان بۆ تیشکەخانە و دواتریش بەدەرزی خرانە ناوی چاوی مشکی کوێرەوە، بەپێی توێژینەوەکە ئەم خانانە توانایان هەیە لەگەڵ پێکهاتەی چاودا یەکبگرن و دەستبکەن بە کارکردن. بەڵام هێشتا رێژەی کاریگەریەکەی نزمە. تەنها نزیکەی هەزار خانە لە کۆی ئەو دوو سەد هەزار خانە گوازراوەیە توانییان لەگەڵ بەشەکانی دیکەی چاوەکەدا یەکبگرن '),
    Health(
        healthText:
            'سوودەکانی توێکڵی هەنار \n\n ١. یارمەتی دابەزاندنی چەورییە زیانبەخشاکان دەدات \n\n ٢. یارمەتی بەهێزکردنی ماسولکەکان دەدات \n\n٣. یارمەتی خێرا ساڕێژبوونی برینەکان دەدات\n\n ٤. یارمەتیی هاوسەنگی شەکر دەدات لە لەشدا\n\n٥. بەرگری دەکات لە دژی\nهەوکردنەکان'),
    Health(
        healthText:
            'ئاوی کەرەوز بۆ نەخۆشی شەکرە و رێکخستنی پەستانی خوێن بەسودە'),
    Health(
      healthText:
          'چەند ڕێگایەکی سروشتی بۆ چارەسەرکردنی کۆکە\n\n  ١. زەعتەر \n\n ٢. خێواو \n\n ٣. هەڵم \n\n ٤. خواردنەوەی شلەمەنییەکان ',
    ),
    Health(
        healthText:
            'نیشانەکانی هەبوونی بەرد لە گوچیلە\n\n ١. ئازاری زۆر لە پشت و لایەکان \n\n ٢. بوونی ئازار لە خوارەوەی سک \n\n ٣. بوونی ئازار لەکاتی میزکردن \n\n  ٤. ڕشانەوەی زۆر \n\n  ٥. تای زۆر و بەرز '),
    Health(
      healthText:
          'خواردنەوەی ئاو لەسەر گەدەی بەتاڵ دەبێتە هۆی ؟\n\n ١، خێراکردنی زیندە چاڵاکی\n لەش \n\n  ٢. ژەهراووی بوون کەم دەکاتەوە \n\n ٣. کەمکردنەوەی چەورییە زیادەکان \n\n ٤. کەمکردنەوەی کێشی لەش \n\n ٥. زیادکردنی خرۆکە سوورەکان \n\n ٦. باشترکردنی سیستەمی لەش  ',
    ),
    Health(
        healthText:
            'نیشانەکانی کەم خوێنی\n\n ١. زەرد هەڵگەڕانی ڕەنگی\n پێست\n\n ٢. هەستکردن بەماندوویەتی \n\n  ٣.سەرسوڕان و سەر ئێشە \n\n  ٤. ساردبوونی دەست و پێ  \n\n ٥. گرانیی لەهەناسە دان و بوونی ئازار لە سینگ \n\n ٦. نارێکی لە لێدانی دڵدا   '),
    Health(
        healthText:
            'بەها خۆراکییە پێویستیەکان بۆ منداڵ\n\n ١. مەگنیسیۆم \n\n ٢. زینک \n\n ٣. ئاسن \n\n ٤. کالیسیۆم'),
    Health(
        healthText:
            'سوودەکانی شۆفان\n\n ١. یارمەتی تەندروستی دڵ دەدات \n\n ٢. مەترسی تووشبوون بە شەکرە کەم دەکاتەوە\n\n ٣. وزەی پێویست بۆ لەش دابین دەکات \n\n ٤. مەترسی ژەهراوی بوون کەمدەکاتەوە '),
    Health(
        healthText:
            'ئەم شەش کردارە زیان بە جگەر دەگەیەنن\n\n ١. کەم خەوی \n\n ٢. کەم خواردنی ئاو \n\n ٣. کەمی ڤیتامین بی ١٢ \n\n ٤. پشتگوێخستنی ژەمی بەیانییان \n\n ٥. زیاد بەکارهێنانی دەرمان \n\n ٦. خواردنە لە قوتونراوەکان '),
    Health(
        healthText:
            '٤ هۆکار بۆبەهێزکردنی مێشک \n\n ١. خوێندنەوەی کتێب \n\n ٢. ئەنجامدانی یارییە هزرییەکان \n\n ٣. شیکارکردنی پرسیاری جیاواز \n\n ٤. بەشداریکردن لە پێشبڕکێ زانستییەکان'),
    Health(
        healthText:
            ' کاریگەریە نەرێنیەکانی قەلەقی لەسەر پێست \n\n ١. وشکبوونەوە \n\n ٢. دەرکەووتنی برین \n\n ٣. دەرکەوتنی زیپکە \n\n ٤. سووتانەوەی پێست '),
    Health(
        healthText:
            'ئەم پێنج هۆکارە کاریگەری دەکەنە سەر کەشی خوێندن \n\n ١. کاتەکانت رێکبخە \n\n ٢. وەرزش بکە \n\n ٣. خۆراکی تەندروست بخۆ \n\n ٤. خشتەی خەوت \n\n ٥. هەمیشە گوێ لەکەسانی گەشبین و ئەرێنی بگرە '),
    Health(
        healthText:
            'خواردنی ئەم خۆراکانە لە شەودا زیانی هەیە\n\n ١. خواردنەوە گازییەکان \n\n ٢. قاوە \n\n ٣. چەرەزات \n\n ٤. شوکولاتە\n\n ٥. خۆراکە ترشەکان  '),
    Health(
        healthText:
            'سوودەکانی ڤیتامین سی بۆ پێست\n\n ١. پاراستنی پێست لە تیشکە زیانبەخشەکانی پێست\n\n ٢. کەمکردنەوەی لۆچ و برینەکانی پێست\n\n ٣. پێدانی ڕەونەقی بە پێست'),
    Health(
        healthText:
            'کاریگەری ئەو ڕووناکیانەی کە لە ئامێرە ئەلیکتڕۆنیەکانەوە دەردەچێت\n\n ١. ئەگەری توشبوون بە شێرپەنجە زیاددەکات\n\n ٢. کاریگەری دەخاتە سەرکاتەکانی نووستن \n\n ٣. کاریگەری دەخاتە سەر دەردانی هۆرمۆنەکان'),
    Health(
        healthText:
            'ئەو میوانەی کە دەوڵەمەندن بە ڤیتامین (بی)\n\n  ١.هەرمێ \n ٢. ئەڤۆکادۆ \n ٣. کیوی \n ٤. پرتەقاڵ \n ٥. خۆخ \n ٦. ترێ \n ٧. مۆز \n ٨. مانگۆ '),
    Health(
        healthText:
            'سوودەکانی کوارگ (قارچک)\n\n ١. سیستەمی بەرگری بەهێز دەکات \n\n ٢. یارمەتی بەهێزکردنی ماسولکەکان دەدات \n\n ٣. ڕێژەی کۆلیستڕۆڵ کەمدەکاتەوە \n\n ٤. بەسوودە بۆ تووشبوانی شەکرە \n\n ٥. دەوڵەمەندە بە ڤیتامین دی و سی \n\n ٦. دەوڵەمەندە بە پڕۆتینەکان و ڕیشاڵەکان '),
    Health(
        healthText:
            'سوودەکانی هانجیری وشککراو \n\n ١، چارەسەری پەستانی بەرزی خوێن دەکات \n\n ٢. کەمکردنەوەی رێژەی چەوری زیانبەخش لە جەستە \n\n ٣. بەهێزکردنی ماسولکەکان و یارمەتیدانیان \n\n ٤. یارمەتی سیستەمی هەرس دەدات \n\n ٥. کەمکردنەوەی کێشی لەش و چاڵاککردنی فەرمانەکان '),
    Health(
        healthText:
            'ئەو ڕووەکانەی یارمەتی \nدابەزینی کێش دەدەن\n\n ١. تۆوی کەتان\n ٢. چای سەوز \n  ٣. جینسینگ \n ٤. زەنجەبیل'),
    Health(
        healthText:
            'چۆن خۆت لە ترشەڵۆکی گەدە ڕزگار دەکەیت؟\n\n ١. وەرزشی ڕۆژانە\n\n ٢. خواردنی ئەو خۆراکانەی کە دەوڵەمەندن بە کاربۆهیدڕات \n\n ٣. خواردنی بەردەوامی ئاو لەکاتە جیاوازەکانی ڕۆژ \n\n ٤. خواردنی کەمتری گۆشت یاخود چەوری\n\n ٥. خواردنی سەوزە و میوە \n\n ٦. دوورکەوتنەوە لە خواردنی دەرەوە '),
    Health(
        healthText:
            '٥ سوودی خوێن بەخشین \n\n ١. دووربوون لە نەخۆشییەکانی دڵ \n\n ٢. باشتربوونی سووڕی خوێن \n\n ٣. کەمبوونەوەی ڕێژەی ئاسنە زیانبەخشەکان \n\n ٤. نوێبوونەوەی خرۆکە سوورەکان \n\n ٥. کەمبوونەوەی ئەگەری تووشبوون بە شێرپەنجە'),
    Health(
        healthText:
            'سوودەکانی چای سەوز\n\n ١. یارمەتی تەندروستی دڵ دەدات \n\n ٢. یارمەتی بەهێزکردنی بیرگە دەدات \n\n ٣. مەترسی شێرپەنجە کەمدەکاتەوە\n\n ٤. یارمەتی دابەزانی کێش\n دەدات \n\n ٥. ئاستی کۆلیستڕۆل و شەکر لە خوێن کەمدەکاتەوە '),
    Health(
        healthText:
            'چەند ڕێنمایەک بۆ خەوتنی باشتر\n\n ١. کاتەکانی نوستنت رێکبخە\n\n ٢. سەرچاوەکانی ڕووناکی بکوژێنەوە\n\n ٣. ڕۆژانە چاڵاکی ئەنجام بدە \n\n ٤. دووربکەوە لە خواردن پێش خەوتن \n\n ٥. دووربکەوە لە ژاوەژاو و دەنگە دەنگ '),
    Health(
        healthText:
            'سوودەکانی هەنار \n\n  ١. کۆلیستڕۆلی خراپ لە خوێن کەمدەکاتەوە\n\n ٢. پەستانی خوێن نزم دەکاتەوە \n\n ٣. چارەسەری ئیسهالی دەکات \n\n ٤. دژە ڤایرۆس و بەکتریایە\n\n ٥. تەندروستی دڵ باشتر دەکات \n\n ٦. بەرگری لە شێرپەنجە دەکات \n\n ٧. خەمۆکی و ڕاڕایی کەم دەکاتەوە '),
    Health(
        healthText:
            'سوودەکانی هەنگوین\n\n ١. سەرچاوەی هێزە \n\n ٢. ئاستی چەوری کەم دەکاتەوە\n\n ٣. پدو و ددان دەپارێزێ\n\n ٤. چارەسەری کۆکەیە\n\n ٥. هیمۆگلۆبینی خوێن زیاد دەکات\n\n ٦.  چارەسەرە بۆ پێستی دەموچاو\n\n ٧. چارەسەر بۆ سوتاوی\n\n ٨. پارێزگاری لە شێرپەنجە دەکات\n\n ٩. دژە جەراسیم ومیکرۆبە\n\n ١٠. چارەسەرە بۆ نەخوشیەکانی گەدە'),
    Health(
        healthText:
            'سوودەکانی پێکەنین و دڵخۆشی\n\n ١. بەرگری لەش بەهێز دەکات \n\n ٢. سووڕی خوێن چاڵاک دەکات \n\n ٣. یافگە بەهێز دەکات \n\n ٤. دەروون ئارام دەکاتەوە \n\n ٥. پەشۆکی و دوودڵی کەم دەکاتەوە\n\n ٦. دڵ لە نەخۆشی دەپارێزێت \n\n ٧. هەست کردن بە ئازار کەم دەکاتەوە'),
    Health(
        healthText:
            'خواردنەوەی ئاو لەم کاتانەدا سوودی زیاترە\n\n ١. دوو پەرداخ ئاو لە دوای هەڵسان لەخەو \n\n ٢. پەرداخێک پێش ٣٠ خولەک لە نانخواردن\n\n ٣. پەرداخێک لە عسراندا\n\n ٤. پەرداخێک پێش نوستن  '),
    Health(
        healthText:
            'نیشانەکانی زیادەڕۆی لە خوێ\n\n ١. هەستکردن بە تینووێتی بەردەوام \n\n ٢. بەرزبوونەوەی کێش و قەڵەوبوون\n\n ٣. بەرزبوونەوەی پەستانی خوێن \n\n ٤. هەڵئاوسانی دەست و پێ '),
    Health(
        healthText:
            'سوودەکانی خواردنەوەی ئاوی گەرم سەرسوڕهێنەرە\n\n ١. سوری خوێن چالاک دەکات\n\n ٢. کرداری هەرسکردن \nخێرا دەکات\n\n ٣. قەبزی ناهێلیت ریخەلۆکەکان چالاک دەکات\n\n ٤. لەش لە مادەی ژەهراوی پاک دەکاتەوە\n\n ٥. لەش لە مادەی ژەهراوی پاک دەکاتەوە\n\n ٦. کاریگەری جوانکاری لەسەر پیست و قــژ هەیە\n\n ٧. کاریگەری زۆر باشی هەیە لەسەر لەدەستدانی کێشی زیاد '),
    Health(
        healthText:
            'ئەو خۆراکانەی یارمەتی بەهێزکردنی ئێسک دەدەن\n\n ١.گێزه‌ر \nكه‌ رێژه‌یه‌كی زۆر كارۆتین و بتاكارۆتین و بتاكریپتوزانیتی تێدایه‌ پێشنیار ده‌كرێت به‌ خاوه‌ی بیخۆین\n\n ٢. گوێز\n سه‌رچاوه‌ی چه‌وری ئۆمێگا ٣ یه‌ و سودی زۆری هه‌یه‌ بۆ له‌ش و ئێسك به‌هێز ده‌كات\n\n ٣.  ناوكه‌كان و تۆوه‌ وشك كراوه‌كانیش رێژه‌یه‌كی زۆر له‌ كانزای وه‌ك مه‌گنسیۆمی تێدایه‌، ئه‌م ره‌گه‌زه‌ یارمه‌تی سووتانی كالیسیۆم ده‌دات كه‌ بۆ ئێسك به‌سوده‌\n\n ٤. شیر\n له‌م خواردنه‌وانه‌یه‌ كه‌ كاریگه‌ری زۆری بۆ سه‌ر له‌ش هه‌یه‌ و له‌ لایه‌ن پسپۆڕانی خۆراكه‌وه‌ پێشنیار ده‌كرێت بۆ به‌هێز كردنی ئێسك به‌ رێژه‌ی باش شیر بخۆینه‌وە'),
    Health(
        healthText:
            'چەند ژمارەیەکی تەندروستی گرنگ\n\n ١. ١٢٠/٨٠ ڕێژەی ئاسایی پەستانی خوێن \n\n ٢. ١٢٠-٨٠ ڕێژەی ئاسایی شەکر لە خوێن \n\n ٣. ٢٠٠ ڕێژەی ئاسایی کۆلیستڕۆڵ لە خوێن\n\n ٤. ٧-٩ ماوەی نووستنی گونجاوی ڕۆژ \n\n ٥. ٢-٣ لیتری ئاوی ڕۆژانە کە پێویستە بخورێتەوە\n\n ٦. ٦٠-٨٠ تێکڕای ئاسایی لێدانی دڵ لە خولەکێکدا'),
    Health(
        healthText:
            'دیارترین ئەو دیاردانەی دەبنە هۆی زیانگەیاندن بە گورچیلە\n\n ١.  زۆر خواردنی خوێ و بەكارهێنانی زۆر لە خواردنەكان\n\n ٢. جگەرە کێشان \n\n ٣. خواردنەوە گازییەکان \n\n ٤. کەمی جوڵە و وەرزش نەکردن \n\n ٥. قەڵەوی و زیاد بوونی کێش\n\n ٦. توێژەرەوان ئەوەيان سەلماندووە ناڕێکی لە كاتەكانی خەو زيان بە تەندروستی گورچيلەكان دەگەيەنێت\n\n ٧. کەم خواردنی ئاو لە ڕۆژدا \n\n ٨. زياد بەكارهێنانی ئەو خواردنەوانەی بە كافايين دەوڵەمەندن\n\n ٩. ڕاگرتنی ميز بۆ ماوەیەكی زۆر\n\n ١٠. بەكارهێنانی زۆری دەرمانە ئازار شكێنەكان'),
    Health(
        healthText:
            'باشترین کات بۆ خواردنەوەی \n\n ١. شیر\nشیر ئێواران\n\n ٢. ئاو\n هەموو کات\n\n ٣. قاوە\nدوای نیوەڕۆ\n\n ٤. چای سەوز\nدوای نانی بەیانی\n\n ٥. ئاوی لیمۆ\nدقای هەڵسان لە خەو\n\n ٦. ئاوی گوڵ\n پێش نووستن'),
    Health(
        healthText:
            'سوودەکانی کاکاو\n\n ١. ئارامت دەکاتەوە \n\n ٢. یارمەتیی گەدە دەدات\n\n ٣. یارمەتیی مێشک دەدات \n\n ٤. دابەزاندنی پەستانی خوێن \n\n  ٥. کەمکردنەوەی هەستکردن بەماندووبوون '),
    Health(
        healthText:
            'بەگوێرەی تیمە زانستییەکە، دەتواندرێت خانەی هەستەوەری رووناکییەکان بگۆڕدرێن و ئەمەش هیوای چاکبوونەوەی کوێریی زیاددەکات. زانستکاران رێگەیەکی نوێیان بەکارهێناوە بۆ دروستکردنی تۆڕی چاو لە تاقیگەدا. ئەم رێگەیە گیرایەبەر بۆ دروستکردن و کۆکردنەوەی هەزاران قەدە خانە کە دواتر ئامادەکران بۆ گۆڕینیان بۆ تیشکەخانە و دواتریش بەدەرزی خرانە ناوی چاوی مشکی کوێرەوە. بەپێی توێژینەوەکە ئەم خانانە توانایان هەیە لەگەڵ پێکهاتەی چاودا یەکبگرن و دەستبکەن بە کارکردن. بەڵام هێشتا رێژەی کاریگەریەکەی نزمە. تەنها نزیکەی هەزار خانە لە کۆی ئەو دوو سەد هەزار خانە گوازراوەیە توانییان لەگەڵ بەشەکانی دیکەی چاوەکەدا یەکبگرن\n\n پزیشکانی بەریتانی لە زانکۆی ئاستۆن رایدەگەیێنن وەرزشکردن لە کەشوهەوای سارد رێگە خۆشدەکات بۆ سووتاندنی کالۆری زیاتر\nپزیشکە بەریتانییەکان لە توێژینەوەیەکدا سوودەکانی وەرزشکردنیان لە کەشوهەوایەکی سارد خستۆتەڕوو\n د. فیلیپ کێرێن، یەکێک لە سەرپەرشتیارانی توێژینەوەکە دەڵێت: وەرزشکردن لە کەشوهەوا سارد سوودی تەندروستی یەکجار زۆری هەن، بۆ دابەزاندنی کێشیش باشترە چونکە رێگەخۆشکەرە بۆ سووتاندنی چەورییەکان، سەرپەرشتیاری توێژینەوەکە روونیدەکاتەوە ئەو کەسانەی لە کەشوهەوای ساردا وەرزشدەکەن دەبێت خۆیان گەرم دابپۆشن، ئاو خواردنەوە و دژە خۆریش لەبیرنەکەن، پزیشکە توێژەرەکان دەڵێن لە کەشوهەوای ساردا جەستە دەتوانێت پلەی گەرمییەکەی رێکبخات بۆیە تاکو زۆرتر وەرزشبکرێت زیاتر کالۆری دەسوتێنرێت و کاریگەرتر دەبێت لە دابەزاندنی کێش، پزیشکە بەریتانییەکانی زانکۆی ئاستۆن رێنمایدەدەنە خەڵک لەنێو کەشوهەوای کراوە و ساردا وەرزشبکەن، چونکە جگەلەوەی کالۆرییەکی زۆرتر دەسوتێت، سیستەمی بەرگری جەستە بەهێزدەبێت و لایەنی دەروونیش باشتردەبێت '),
    Health(
        healthText:
            'بەپێی گرووپی خوێنەکەت پێویستە چ جۆرە خواردنێک بخۆیت؟\n\n لێكۆڵینه‌وه‌ نوێیه‌كان ده‌ریانخستووه‌ كه‌ گرووپی خوێن په‌یوه‌ندییه‌كی زۆری له‌گه‌ڵ ته‌ندروستی هه‌یه‌. بۆ نموونه‌ له‌ هه‌ندێك له‌ گروپه‌ خوێنه‌كاندا مه‌ترسی توشبوون به‌ نه‌خۆشییه‌كانی دڵ و ده‌مارو گرفته‌كانی زه‌ین زۆرتره‌، له‌ كاتێكدا گروپی خوێنی (ئۆ) له‌ به‌رامبه‌ر توشبوون به‌ شێرپه‌نجه‌دا پارێزراوتره‌, ئەمانەی خوارەوە کۆمەڵێک ڕێنمایی گرنگن بە پێی گروپی خوێنتان،\n\n ١. جۆری خوێنی (ئەی) خواردنی دانەوێڵەی و سەوزەکان پێشنیار دەکرێت لەگەڵ ڕیجیمی سەوزەمەنی پێشنیار کراوە لە حاڵەتی ڕیجیم کردندا، هەروەها گرنگە ئەو خواردنانەی دەیخۆن پێکهاتەی نوێ و ئەندامی بن\n\n ٢. جۆری خوێنی (بی) دەتوانن بە هەمەجۆری خۆراکەکان لەگەڵ خواردندا بڕۆن، وەکوو گەنمەشامی و سپییەمەنییەکان و تەماتە، و فستق کە دەبێتە هۆی کێش دابەزاندن. گرنگە زۆر خۆیان بپارێزن لە گۆشتی مریشک و جێگرەوەکانی وەکو گۆشتی کەروێشک و بزن و بەرخ بکەنە جێگرەوەی\n\n ٣. جۆری (ئەی بی) تێکەڵەیەکە لە خوێنی ئەی و بی، گەدەیان ڕێژەیەکی کەمی ئەسیدی تێدایە خواردنی هێلکە و خواردنە دەریاییەکانی هەروەها ئەو خواردنانەشی کە گەڵایان سەوزە\n\n ٤. جۆری (ئۆ) پێویستە خواردنە گۆشتییەکانیان کوالێتی بەرز بێت، لەگەڵ خواردنی ماسی و سەوزەوات و میوەکان یەکێکی دیکەیە لە پێشنیارەکانمان'),
    Health(
        healthText:
            'پێنج سوودی خواردنەوەی ئاو لەزستاندا\n\nگومانی تێدانییە کە لە وەرزی سەرمادا کەمتر ئاو دەخۆینەوە بە بەراورد بە هاوین و وەرزی گەرما، چونکە جەستە پلەی گەرمی بەرزنییە و کەمتر هەست بە تینوێتی دەکەیت، بەڵام هەڵەیە و دەبێت بەهەمانشێوە ئاو بخۆیتەوە رۆژانە\n ١. وزەیەکی باش بە جەستەت دەبەخشێت\n\n ٢. وزەیەکی باش بە جەستەت دەبەخشێت\n\n ٣. لەش لە ژەهراوی بوون دەپارێزێت\n\n ٤. کرداری هەرس چالاک دەکات، بەڵام لە کاتی نان خواردن زیانی هەیە\n\n ٥. رێگا لە زیادبوونی کێشت دەگرێت  '),
    Health(
        healthText:
            '٧ رێگای سروشتی بۆ نەهێشتنی چەوری نێو بۆرییەكانی خوێن\n\n ١. گۆڕینی ڕۆتینی باوی ڕۆژانەت، بە زیادکردنی بەرنامەی وەرزشی و گۆرانکاری لە کاتی خواردنی ژەمەکاندا تاوەکو مێشکت بجوڵێت، زیادکردنی سەوزەو خواردنە دەریاییەکان بەهۆی زۆری ڕێژەی ئۆمێگا ٣ تیایاندا\n\n ٢. گۆرینی چەورییە زیانبەخشەکان بە چەورییە سروشتیەکان وەک بادەم، بەپێی ئەو توێژینەوەکان هەر كەسێك بەیانیان بەر لە خواردنی هەر شتێك ١٠ دەنك بادەم بخوات، ئەوا چەوری نێو خوێنی لە ماوەی ١٢ هەفتە بە ڕێژەی ١٤ تا ٪١٦ كەم دەكاتەوە\n\n ٣. خواردنی شەربەتی هەنار،\n دڵ و خوێنەبەرەکان لە نەخۆشی دەپارێزێت، چونکە دژەئۆکسانەکانی رێگا لە کۆبوونەوەی کۆلیسترۆڵ \nدەگرێت، یارمەتی ڕاگرتنی هاوسەنگی پەستانی خوێن دەدات لە لەشدا و جەستە لە دروستبوونی جۆرەکانی خانەی شێرپەنجەیی دەپارێزێت\n\n ٤. چای سەوز و چای زەنجەبیل، كاریگەری زۆر بەهێزی هەیە بۆ كەم كردنەوەی چەوری زیانبەخش لە خوێندا، دەتوانن قاشێك لیمۆ یان گەڵای نەعنای تێ بكەن و بەیانیان زوو بیخۆنەوە، لە ماوەیەكی كەمدا دەبێتە هۆی نەهێشتنی ڕێژەیەكی زۆری چەوری جۆری زیانبەخش لە خوێندا\n\n ٥. زیادکردنی زەردەچەوە لە ژەمە خواردنەکاندا یارمەتی تەندروستی دڵ دەدات و رێگە نادات خوێن لە دەمارەکاندا کۆبێتەوە، وەک دژە هەوکردنێک کار دەکات بەهۆی بوونی ماددەی کرکومین تیادا\n\n ٦. زیادکردنی سەوزە و پاقلەمەنییەكان، ئەوانەی چەوری خوێنیان بەرزە هیچ كات خواردنی پاقلەمەنییەكان لەیاد نەكەن، كە لە “پاقلە و نیسك و بەزالیا” پێك دێن هەروەها زیادکردنی سەوزەکانی وەک برۆكۆلى و گێزەر، سپێناخ\n\n ٧. دورکەوتنەوە لە خواردنی جگەرە،کە دەبێتە هۆی کەڵەکەبوونی چەوری\n و زیادبونی ڕێژەی خەستی خوێن، لەئاکامدا جەڵتەی لێدەکەوێتەوە'),
    Health(
        healthText:
            'هەنار چارەسەری زەهایمەر و پاركنسۆن دەكات\n\n چەند پسپۆڕێكی بەریتانی توێژینەوەیەكیان لەسەر سودەكانی هەنار ئەنجامداوە و بۆیان دەركەوتووە خواردنی ئەو میوەیە دەبێت هۆی چارەسەركردنی نەخۆشییەكانی زەهایمەر و پاركنسۆن، بەپێی ئەنجامی توێژینەوەیەك كە چەند پسپۆڕێكی زانكۆی هادرسفیڵد لە بەریتانیا ئەنجامیانداوە، دەركەوتووە توێكڵی هەنار ماددەی بۆنكالاگین لە پێكهاتەكەیدایە كە دەبێتە هۆی ڕێگری كردن لە ئەگەری توشبون بە نەخۆشی زەهایمەر و پاركنسۆن، توێژەرەكان ئاماژە بەوە دەكەن كە ماددەی بۆنكالاگین دەبێتە هۆی ڕێگری كردن لە هەوكردنی\n ئەو خانانەی مێشك كە هۆكاری توشبونن بە زەهایمەر و پاركنسۆن، سەبارەت بە چاكبونەوەی ئەو كەسانەی ئەو دوو نەخۆشییەیان هەیە، سەرپەرشتیاری توێژینەوەكە ئاماژە بەوە دەكات كە هەنار نابێتە هۆی چاكبونەوەی ئەو كەسانە بەڵام نەخۆشییەكەیان لەئاستێكدا ڕادەگەڕێت و ڕێگری دەكات لەوەی تەندروستیان بەرە و خراپتر بچێت '),
    Health(
        healthText:
            'شوکولاتە لە نەخۆشییەکی مەترسیدار دەتپارێزێت\n\n بەپێی ئەنجامی توێژینەوەیەکی نوێ، خواردنی شوکولاتە لە توشبون بە نەخۆشییەکی مەترسیدار دوورتدەخاتەوە، رۆژنامەی سەنی بەریتانی لەپەڕەی تەندروستی خۆیدا ناوەڕۆکی توێژینەوەکەی بڵاوکردۆتەوە و دەڵێت ئەگەر لەمانگێکدا سێ جار شوکولاتە بخورێت ئەگەری توشبون بە جۆرەکانی جەڵتە کەمدەکاتەوە، دوین میلور شارەزا لەبواری خۆراک لە زانکۆی کۆڤێنتەری دەڵێت "بەبیروڕای هەندێک کەس خواردنی شوکولاتە زەرەری هەیە، بەڵام لە راستیدا وانیە و پێکهاتوە لە چەندین گەرمۆکەی بەرز، کانزای مەنگسیۆم لە پێکهاتەیەکدا هەیە و نابێتە مەترسی بۆ توشبون بە نەخۆشییەکانی دڵ و بەرزبوونەوەی رێژەی کۆلیستڕۆڵ لە خوێندا"، دوین میلور ئاماژەوە بەوە دەکات ماددەی کیمیاوی فلافانولات لە دەنکۆڵەی کاکاودا هەیە کە هاوشێوەی ئیبیکاتیشینە کە لەچای سەوزدا هەیەو ئەمەش بەسوودە بۆ و سوڕی خوێن چالاک دەکات و رێژەی کۆلیستڕۆڵ لە خوێندا کەم دەکاتەوە، بە پێی ئەنجامی توێژینەوکانی پێشوو، شوکولاتە چەندین سودی بۆ لەش هەیە لەوانە؛ فشاری خوێن هاوسەنگ دەکات لەگەڵ چالاکبوونەوەی مێشک و نەهێشتنی خەمۆکی '),
    Health(
        healthText:
            'ئەو خواردنانەی كە بەرگری لەش زیاد دەكەن لە دژی سەرما\n\n پسپۆڕانی بواری خۆراكی چەند جۆرە خۆراكێكیان دیاری كردووە كە دەبێتە هۆی پاراستنی لەش لە ئەگەرەكانی توشبوون بە نەخۆشییە باوەكانی وەرزی سەرما، هەروەها چارەسەری ئەو كەسانەش خێراتر دەكەن كە توشی نەخۆشیەكان بوون، شۆربا، یەكێكە لەو خواردنانەی كە بەسوودە بۆ وەزری سەرما، بەتایبەتی شۆربای مریشك، چونكە ئەم جۆرە شۆرباییە دەوڵەمەندە بە ترشە ئەمینیەكان ئەوەش چارەسەرێكی باش دەبێت بۆ ئەو كەسانەی توووشی هەوكردنی سیەكان بوون، پسپۆڕەكان ئاماژە بەوەش دەكەن خواردنی پاقلەمەنیەكان زۆر گرنگە چونكە رێژەیەكی زۆری لە ووزەی تێدایە و دەبێتە هۆی بەهێزكردنی بەرگری لەش دژی نەخۆشییە جیاوازەكان، هەروەها بیبەری توون و میوەكانی وەك پرتەقاڵ و كیوی سودی زۆری بۆ لەش هەیە لەم وەرزەدا ئەمەش بەهۆی بونی كۆمەڵێك ماددەی سروشتی بەسوود و كانزا جیاوازەكان لە پێكهاتەكەیاندا'),
    Health(
        healthText:
            'چەند زانیارییەک دەربارەی\n لەشی مرۆڤ\n\nلەشی مرۆڤ بە‌ سەرجە‌م ئە‌و کۆندامانە دە‌ڵێن کە بۆ بە‌ڕێوە‌بردنی ئەرکەکانی لەش لە دەوری یەک کۆبوونەتەوە. لەش ئەوەی کە بەرچاو دەکەوێت لە سەر، تە‌نە‌، دوو دەست و دوو لاق پێک ھاتووە‌. بەرەبەرە کە مرۆڤ پێدەگات ژمارەی خانەکانی زۆرتر دەبێت و لە بەرزترین شوێنیدا ئەم ئامارە بە ١٠٠ تریلیۆن دەگات، مێشکی مرۆڤ یەکێکە لە ئاڵۆزترین ئەندامەکانی لەشی مرۆڤ. ئەو شوێنەیە کە تێیدا بیرکردنەوە، یادەوەری، ھەست و ئەزمونکردن پرۆسە دەکرێت. ئەم ئەندامەی لەشمان کە نزیکەی ١.٤ کیلۆگرام دەبێت، نزیکەی دوو سەد میلیار (٢٠٠،٠٠٠،٠٠٠،٠٠٠) دەمارەخانەی تێدایە. ئاڵۆزی پەیوەندی نێوان ئەم دەمارەخانانە مێشکی مرۆڤ دەئاوسێنێت. ھەر یەک لە دەمارەخانەکان پەیوەندی بە ھەزاران یان دەیان ھەزار دەمارەخانەی دیکەوە دەکەن لەڕێگەی پێکھاتەی زۆر بچووکەوە کە پێیان دەوترێت گەیێنکە دەمار (سایناپسێس) کە ژمارەیان دەگاتە (١٢٥) تریلیۆن. ھەموو چرکەیەک لە ژیانماندا، مێشکمان ملیۆنان پەیوەندی نوێ دروست دەکات. شێواز و بەھێزی ئەم پەیوەندیانە بەبەردەوامی لە گۆڕاندایە و دەماخی ھیچ دوو مرۆڤێک لە یەکتر ناچێت، چەند زانیاریەک لەسەر لەشی مرۆڤ کە لەوانەیە تا ئێستا نەتزانیبێت\n\n مێشکی مرۆڤ لە یەک چرکەدا ٢ ملیۆن زانیاری خەزن دەکات، لەگەڵ ئەوەی کێشی لە ٢ کگم زیاتر نیە، ھەروەھا ١٥٠ ملیار خانەی تێدایە\n\n  سەری زمان سێ ھەستەوەری تێدایە، یەکەم تامی ترش جیا دەکاتەوە، دووەم شیرینی، سێیەم سوێری\n\n  سپڵی مرۆڤ ھەموو شەش ھەفتە جارێک تازە دەبێتەوە\n\n  چاو لە رۆژێکدا زیاتر لە ٨٠٠٠ ھەزار جار دەکرێتەوەو دادەخرێت\n\n  گورچیلە ھەموو ٨ ھەفتەیەک تازە دەبێتەوە \n\n پێستی مرۆڤ ھەموو مانگ و نیوێک تازە دەبێتەوە \n\n بڕبڕەی پشت ھەموو شەش مانگ جارێک تازە دەبێتەوە \n\n دڵ لە رۆژێکدا  ١٠٠ ھەزار جار لێدەدات '),
    Health(
        healthText:
            'کەمی ئاستی ڤیتامین سی هۆکارێکە بۆ قەڵەوبوون\n\n پزیشکانی زانکۆی ئایزۆنای ئەمریکی دەڵێن کەمی ئاستی ڤیتامین سی لە جەستە هۆکارێکی زیادبوونی\n کێشی لەش و قەڵەوبوونە، پزیشکە ئەمریکییەکان لە توێژینەوەکدا پەیوەندییان دۆزیوەتەوە لەنێوان کەمی ڤیتامین سی لەلایەک و قەڵەوبوون لەلایەکی دیکە و ئەنجامەکەشیان لە جۆرناڵی (نوتریشن) بڵاوکردووەتەوە، د.کارۆل جۆنستۆن، پسپۆری خۆراک لە زانکۆی ئاریزۆنا و سەرپەرشتیاری توێژینەوەکە دەڵێت: "ڤیتامین سی رۆڵی \nهەیە لە کرداری میتابۆلیزمی چەورییەکان، بۆیە کاتێک رێژەی ئەم ڤیتامینە کەمبێت جەستە توانای مێتابۆلیزمی خۆی بۆ چەورییەکان بەرێژەی ٪١١ لەدەستدەدات"، پزیشکە ئەمریکییەکان دەڵێن ئەو کەسانەی قەڵەون یاخود بەبێ هیچ هۆکارێک هەست بە زیادبوونی کێشیان دەکەن هۆکارێکی شاراوە دەکرێت کەمی ڤیتامین سی بێت، بۆیە رۆژانە ٩٠ملیگرام لەم ڤیتامینە پێویستە بۆ کرداری ئاسایی میتابۆڵیزمی چەورییەکان لە لەش، خۆراکناسە ئەمریکییەکان خواردنی ئەو خۆراکانەی دەوڵەمەندن بە ڤیتامین سی بەباشترین چارەسەر دادەنێن لەوانەش پرتەقاڵ، لیمۆ، برۆکلی و سپێناخ، ڤیتامین سی یان ترشی ئەسکۆربیک یەکێکە ڤیتامینە سەرەکییەکان کە لەش پێویستییەتی، رۆڵی ئەم ڤیتامینە لە لەشدا گرنگە بۆ کەمکردنەوەی پەستانی خوێن، هەبوونی چاو و پێستێکی تەندروست، پاراستنی سیستەمی بەرگری لەش و مەترسی تووشبوون بە شێرپەنجە و نەخۆشییەکانی دڵ کەمدەکاتەوە '),
    Health(
        healthText:
            '٨ زانیاری دەربارەی چاو\n\n ١.  لە یەک خولەکدا (۱۲) جار چاوتروکاندن ڕوودەدات لە \nڕۆژێکدا (۱۰٫۰۰۰) جار ڕوودەدات\n\n ٢. چاوی مرۆڤ لە زیاتر لە (۲) ملیۆن بەش پێکدێت\n\n ٣. چاوی مرۆڤ (٥۷٦) مێگاپێکسڵە\n\n ٤. کۆڕنییەی چاو تەنها شانەیە کە پێویستی بە خوێن نیە و خوێنی بۆ ناچێت\n\n ٥. چاوی مرۆڤ توانای (۳٦٫۰۰۰) پڕۆسێس کردنی زانیاری هەیە\n لە کاتژمێرێکدا\n\n ٦. کێشی چاوی مرۆڤ نزیکەی (۲٨) گرامە\n\n ٧. ڕەنگ کوێری لە پیاواندا (۱۰) جار زیاترە وەک لە ئافرەتان\n\n ٨.  لەکاتی پژمیندا چاو دادەخرێت'),
    Health(
        healthText:
            'زۆر خواردنەوەی قاوە ئەگەری توشبوون بە شەكرە زیاددەكات\n\n ئەنجامی توێژینەوەیەكی پزیشكی ئاشكرای دەكات زۆر خواردنەوەی قاوە، ئەگەری توشبونی ئەو كەسانەی کە پەستانی خوێنیان بەرزە و كێشیان زۆرە، بە نەخۆشی شەكرە زیاد دەكات\n توێژینەوەكە لە ئیتاڵیا ئەنجامدراوە و باسی لەوە كردووە، خواردنەوەی زیاتر لە سێ كوپ قاوە بە شێوەیەكی بەردەوام و ڕۆژانە بۆ ئەوكەسانەی پەستانی خوێنیان بەرزە و كێشیان زیادە زیانی هەیە و دوو هێندە ئەگەری توشبوون بە نەخۆشی شەكرە زیاد دەكات\n توێژینەوەكە لەسەر هەزار و ١٨٠ كەس ئەنجامدراوە كە تەمەنیان لەنێوان ١٨ بۆ ٤٥ ساڵیدا بووە، ماوەی شەش ساڵ چاودێری ڕێژەی خواردنەوەی قاوە و كاریگەرییەكانی كراوە لەسەر ئەو كەسانە\n ئەنجامەكان دەریانخستووە كە زۆر خورادنەوەی قاوە بەگشتی زیانی هەیە، بەڵام بۆ ئەو كەسانەی كە فشاری خوێنیان بەرزە و كێشان زیادە زیانەكەی زیاترە، بە تایبەت بۆ ئەگەری توشبوون بە شەكرە\n ئەم توێژینەوەیە پێچەوانەی ئەنجامی چەند توێژینەوەیەكی پێشوترە كە دەریخستبوو خواردنەوەی قاوە ئەگەری توشوبوون بە نەخۆشی شەكرە كەمدەكاتەوە '),
    Health(
        healthText:
            '٩ خۆراک بۆ خۆپاراستن لە پیربوون\n\n ١. سیر\n ٢. زەردەچوو\n ٣. ئەڤۆکادۆ\n ٤. بادەم\n ٥. سپێناخ\n ٦. هەنار \n ٧. زەمجەبیل\n ٨. گوێزی هندی\n ٩. توو'),
    Health(
        healthText:
            '٦ ھۆکار  بۆ بێتاقەتی\n\n  ١. کەمی ڤیتامینەکان لە لەشدا\n\n ٢.کەمی خەو \n\n ٣. کەمیی ئاو لە لەشدا \n\n ٤. کەمیی جووڵە کردن \n\n ٥.ناتەواوی لەھۆرمۆنەکان \n\n ٦. زیادەرۆی لە شەکر و خواردنە خێراکان'),
    Health(
        healthText:
            'ئاشنابە بە سوودەکانی ئەم خۆراکانە\n\n ١.جاترە\nپەستانی خوێن کەمدەکاتەوە\n\n ٢. زەنجەبیل\nچارەسەری ئەفلەوەنزا دەکات \n\n ٣. سیر\n دژە بەکتریایە\n\n ٤. کەمون \n بەرگری لەش زیاد دەکات \n\n ٥. گوێز\n مێشک بەهێز دەکات'),
    Health(
        healthText:
            'سوودەکانی خۆشوشتن بە ئاوی سارد\n\n ١. یارمەتی بەهێز کردنی مێشک دەدات \n\n ٢. ئازار کەمدەکاتەوە \n\n ٣. یارمەتی سووڕی خوێن دەدات \n\n ٤. بەسوودە بۆ ڕووخسار و پێست \n\n ٥. توانای لەش زیاد دەکات'),
    Health(
        healthText:
            'نیشانەکانی کەمی ڤیتامین\n سی لەلەشدا \n\n ١. خوێنھاتنی بەردەوام لەلەش \n\n ٢. درەنگ ساڕێژبوونەوەی برینەکان\n\n ٣. وشکبوونەوەی قژ و ھەڵوەرینی \n\n ٤. ھەستیاری لە پووک\n\n ٥. وشکبوونەوەی پێست\n\n ٦. تێکچوونی سیستەمی ھەرس\n\n ٧. لاوازبوونی سیستەمی بەرگری لەش'),
    Health(
        healthText:
            'چۆن ھەستەکانت کار دەکەنە سەر تەندرووستی؟\n\n ١. قەلەقی\n گەدەت لاواز دەکات \n\n ٢. دڵتەنگی\n سییەکانت لاواز دەکات \n\n ٣. پەستانی دەروونی\n دڵ و مێشکت لاواز دەکات\n\n ٤. تووڕەیی\n جگەرت لاواز دەکات\n\n ٥. ترس\n گورچیلەکانت لاواز دەکات '),
    Health(
        healthText:
            'چەند خۆراکێکی بەسوود بۆ تەندرووستی دڵ \n\n ١. نیسک\n\n ٢. شۆفان \n\n ٣. شووتی \n\n ٤. سێو\n\n ٥. توو\n\n ٦. ترێ'),
    Health(
        healthText:
            'پێویستە خاوەنی ئەم کارامەییانە بیت لەژیاندا بۆ ئەوەی سەرکەوتوو بیت\n\n ١. متمانە بەخۆبوون\n\n ٢. پلاندانان\n\n ٣. گرینگیدان بە کارە لە پێشیینەیەکان\n\n ٤. توانای چارەسەرکردنی کێشەکان \n\n ٥. ڕێکخستنی کات\n\n ٦. ھێزی خۆڕاگری و ئارامگرتن'),
    Health(
        healthText:
            'کاریگەرییەکانی جگەرە لەسەر مێشک\n\n ١. توانای تەرکیزکردن کەم دەکاتەوە\n\n ٢. ھانی توڕەبوون و قەلەقی دەدات\n\n ٣. کاریگەری ھەیە لەسەر پێکھاتەی مێشک\n\n ٤. ئەگەری تووشبوون بە جەڵتەی مێشک زیاد دەکات '),
    Health(
        healthText:
            'سوودەکانی چەوەندەر \n\n ١. یارمەتی ھاوسەنگی کێشی لەش دەدات \n\n ٢. یارمەتی بەرگری لەش دەدات\n\n ٣. بەسوودە بۆ ھەرس\n\n ٤. بەسوودە بۆ تووشبوانی نەخۆشی شەکرە\n\n ٥. یارمەتی دابەزاندنی پەستانی بەرزی خوێن دەدات'),
    Health(
        healthText:
            'سوودەکانی بادەم\n\n ١. یارمەتی دابەزاندنی کێشی لەش دەدات\n\n ٢. یارمەتی ھەرس دەدات\n\n ٣. بەسوودە بۆ تەندرووستی دڵ\n\n ٤. وزە بە لەش دەبەخشێت \n\n ٥. ئاستی شەکر ڕێکدەخاتەوە \n\n ٦. دەوڵەمەندە بە ڕیشاڵ و پڕۆتینەکان'),
    Health(
        healthText:
            'کاریگەری خواردنەوەی\n بەردەوامی ئاو\n\n ١. چالاکیت زیاد دەکات\n\n ٢. یارمەتی ھەرسکردن دەدات\n\n ٣. دابەزینی کێشی لەش\n\n ٤. وزەت زیاد دەکات\n\n ٥. پێستت باشتر دەکات\n\n ٦. یادگەت بەھێزتر دەکات'),
    Health(
        healthText:
            'بیر بکەوە ئەگەر واز لەشەکر بھێنیت \n\n ١. دووردەبیت لە خەمۆکی\n\n ٢. بیرگەت بەھێز دەبێت \n\n ٣. لێدانی دڵت ڕێکدەخرێتەوە\n\n ٤. دوور دەبیت لە شەکرە\n\n ٥. کێشت دادەبەزێت\n\n ٦. سیستەمی نووستنت ڕێکدەبێتەوە\n\n ٧. پێستت نوێ دەبێتەوە'),
    Health(
        healthText:
            'چەند خۆراکێکی بەسوود بۆ ئەندامەکانی لەش \n\n  ١. بۆ گورچیلەکان\nفاسۆلیا  و ئاو\n\n ٢. بۆ مێشک\nگوێز و قاوە \n\n ٣. بۆ دڵ\nسێو  و سەلمۆن\n\n ٤. بۆ گەدە\nپەتاتە و باوی\n\n ٥. بۆ خوێن\nچەوەندەر و نیسک  '),
    Health(
        healthText:
            'ھۆکارەکانی برسێتی بەردەوام \n\n ١. پەستانی دەروونی\n\n ٢. نەخواردنەوەی بڕی پێویست لە ئاو \n\n ٣. کەمی پڕۆتین لە لەشدا\n\n ٤. خواردنی خۆراک بە شێوەیەکی خێرا\n\n ٥. نەخواردنی ژەمی بەیانی \n\n ٦. نەنووستن بۆ ماوەیەکی زۆر'),
    Health(
        healthText:
            'سوودەکانی خوێن بەخشین\n\n ١. تەندروستی دڵ دەپارێزێت\n\n ٢. سوڕی خوێن چاڵاک دەکاتەوە\n\n ٣. مەترسی تووشبوون کێشەکانی دڵ کەم دەکاتەوە\n\n ٤. مەترسی تووشبوون بە جەڵتەی مێشک کەمدەکاتەوە\n\n ٥. مەترسی بەرزبوونەوەی پەستانی خوێن کەمدەکاتەوە'),
  ];
  void nextHealth() {
    if (_healthNumber < _healthBank.length - 1) {
      _healthNumber++;
    }
  }

  void previousHealth() {
    if (_healthNumber != 0) {
      _healthNumber--;
    }
  }

  String getHealthText() {
    return _healthBank[_healthNumber].healthText;
  }

  bool isFinished() {
    if (_healthNumber >= _healthBank.length - 1) {
      print('Now returning true');
      return true;
    } else {
      return false;
    }
  }

  void reset() {
    _healthNumber = 0;
  }
}
