import 'Data.dart';

class Motivaty {
  int _motivateNumber = 0;
  List<Motivate> _motivateBank = [
    Motivate(
        motivateText:
            '٦ یاسای سەرەکی بۆ گەشەپێدانی خود\n\n ١. هەمیشە بیر لەباشترین بکەوە\n\n ٢. ئەرێنی بوون گەشبینی لە ژیاندا \n\n ٣. پلان دانان و بەڕێوبردنی کات \n\n ٤. ئەو شتە دیاری بکە کە دەتەوێ لێی باشبیت \n\n ٥. هەوڵ و کۆششی زیاتر بدە\n\n ٦. ئارامی\n چونکە ئەنجامی باش پێویستی بە ئارامی هەیە'),
    Motivate(
        motivateText:
            'بۆچی پێویستە ئەنجامان هەبێت\n\n ١. هیوامان پێدەدات بۆ ئەوەی کاربکەین بەبێ ماندووبو\n\n ٢. دەبێتە هۆی وزە و توانامان بۆ ئەوەی کۆشش بکەین  \n\n ٣.یارمەتیمان دەدات بۆ ئەوەی پلانی بۆ دابنێین و ئەرێنی بین \n\n ٤. بەگەشبینی دەمانهێڵێتەوە بەرەو پلانەکانمان  '),
    Motivate(
      motivateText:
          'شەش هۆکار کە کاتەکانت بە\n فیڕ دەدەن \n\n ١. دواخستنی کارە لە پێشینەکان \n\n ٢. نەبونی بوێری بۆ بڕیاردان \n\n ٣. زۆر گرینگیدان بە شتی لاوەکی \n\n ٤. ڕاڕایی \n\n ٥. خۆبەراوردکردن بە کەسانی تر \n\n ٦.چاوەڕوانی و هەوڵنەدان  ',
    ),
    Motivate(
        motivateText:
            ' چۆن چارەسەری بێهیوایی دەکەیت\n لە ژیاندا؟ \n\n ١. دۆزینەوەی هۆکار و چارەسەرکردنی \n\n ٢. پشت بەستن بەخودا \n\n ٣. خوێندنەوە \n\n ٤.گفتوگۆکردن لەگەڵ هاوڕێکانت'),
    Motivate(
        motivateText:
            '            چۆن مەحاڵ دەگۆریت بۆ ڕاستی؟\n\n ١. دیاریکردنی ئامانج\n\n ٢. متمانە\n\n ٣. پلاندانان \n\n ٤. هاوڵدان و بەردەوامبوون'),
    Motivate(
        motivateText:
            'هۆکارەکانی شکست \n\n ١. ترس لە داهاتوو \n\n ٢. هەستکردن بە لە لاوازی \n\n ٣. نا ئومێدبوون لە ژیان \n\n ٤. خۆ ڕادەستکردنی شکست و هەوڵنەدان '),
    Motivate(
        motivateText:
            'بنەماکانی گفتئگۆکردن \n\n ١. گوێڕاگرتن \n\n ٢، ڕێزگرتن  \n\n ٣. گفتوگۆ کردنی بابەتییانە \n\n ٤. ئازادی بیر و ڕا  \n\n ٥. دەرنجدان \n\n  ٦. پاراستنی ئارامی \n\n ٧.  یەکسانی لەدەربڕین'),
    Motivate(
      motivateText:
          'چۆن خۆت لە ڕەشبینی دوور دەخەیتەوە؟\n\n ١. ئامانجەکانت بنووسەوە\n\n ٢. دووربە لە کەسانی بەرێنی \n\n ٣. دۆستی کەسانی ئومێد بەخش بە \n\n ٤. کاتەکانت دابەش بکە \n\n ٥. بشوو وەربگرە \n\n ٦. خاوەن پلان  ',
    ),
    Motivate(
        motivateText:
            '٥ زمان کە پێویستە فێڕیان ببیت\n\n ١. زمانی لێبوردەی\n\n  ٢. زمانی بەخشین \n\n ٣. زمانی زەردەخەنە  \n\n ٤. زمانی گفتوگۆ \n\n ٥. زمانی لێک طێگەیشتن '),
    Motivate(
      motivateText:
          'گرینگترین ئەو بەهرانەی کە پێویستە لە ژیاندا بیزانیت\n\n ١. داهێنان و بیرکردنەوەی داهێنەرانە \n\n ٢. رێکخستنەوەی کەلوپەلەکان \n\n ٣. ڕێکخستنی لە پێشینەکان \n\n ٤. گفتوگۆ کردن \n\n ٥. کۆڵنەدان و خۆڕاگری \n\n  ٦. متمانە بەخۆبوون   ',
    ),
    Motivate(
        motivateText:
            'ئەمانە ذڵخۆشیەکانت تێکدەدەن\n\n ١. سەرقاڵبوون بە ژیانی ئەوانیترەوە\n\n ٢، بیرکردنەوەی نەرێنی \n\n  ٣. گۆشەگیری \n\n ٤. زۆر وردبوونەوە ە کێشەکان \n\n ٥. بێ پلانی '),
    Motivate(
        motivateText:
            'چۆن هەڵسوکەوت لەگەڵ منداڵی تووڕە دەکەیت\n\n ١. دابینکردنی کەشێکی ئارام لە ماڵەوە\n\n ٢. هاندانی منداڵەکە و پاڵپشتی کردنی \n\n  ٣. دوورکەوتنەوە لە بەکارهێنانی توند و تیژی و لێدان \n\n  ٤. پێدانی ڕێز و خۆشەویستی بە منداڵەکە \n\n ٥. ئامۆژگاریکردنی بەردەوام \n\n ٦. یاریکردن لەگەڵی بەتایبەتی ئەو یاریانەی کە دەبنە هۆی بەهێزکردنی ،ێشک '),
    Motivate(
        motivateText:
            'ئەم چوار دەستەواژەیە بەکارمەهێنە لەکاتی چاو پێکەوتندا \n\n  ١. بەڕێوبەری پێشترم کێشەی هەبوو لەگەڵم \n\n ٢. ببورە من تۆزێک پەشۆکاوم \n\n ٣. چاوپێکەوتنەکە چەند دەخایەنێت؟ \n\n ٤. پڕۆژەکانی کۆمپانیاکەتان چین؟ '),
    Motivate(
        motivateText:
            '٩ ڕێنمایی بەرەو ژیانێکی باشتر\n\n ١. ھەمیشە لە گۆرانکاریدا بە بەرەو باشتر\n\n ٢. باوەڕت بە خۆت ھەبێت\n\n ٣. پەند وەربگرە لەشکستەکان\n\n ٤. یارمەتی دەوروبەرت بدەn\n ٥. کاتەکانت رێک بخە\n\n ٦. پلان دابنێ\n\n ٧. ھەمیشە گەشبین بە\n\n ٨. دووربە لە گۆشەگیری\n\n ٩. ئەرێنی بە'),
    Motivate(
        motivateText:
            'چەند ڕێگایەک بۆ ئەوەی باشتر زانیاریەکانت بیربمێنێت؟ \n\n  ١. خۆت تاقی بکەوە \n\n ٢. زانیاریەکان بنووسەوە \n\n  ٣. زانیاریەکانت ڕێکبخە \n\n  ٤. لە شوێنێکی گونجاو بخوێنە \n\n ٥. پشوو بە مێشک بدە \n\n ٦. زانیاریەکان دووبارە بکەوە   '),
    Motivate(
        motivateText:
            'سیفەتەکانی کەسی سەرکەوتوو\n\n ١. کاتەکانی رێكدەخات\n\n ٢. گەشبینە\n\n ٣. هیوابەخشە \n\n ٤. کەسێکی کۆمەڵایەتیە \n\n ٥. فێڕخوازە \n\n ٦. خوێنەرە\n\n ٧. پەند لە شکست وەردەگرێ'),
    Motivate(
        motivateText:
            'ئەم پێنج هۆکارە کاریگەری دەکەنە سەر کەشی خوێندن\n\n ١. نەرێنی بوون \n\n ٢. ترس لەشکست \n\n ٣. نەبوونی هاندان \n\n ٤. پشتگوێخستن \n\n ٥. نەبوونی پلان'),
    Motivate(
        motivateText:
            'ئەمانە خۆشییەکانت تێکدەدەن\n\n ١. خۆپەرستی \n\n ٢. ڕەشبینی \n\n ٣. درۆکردن \n\n ٤. هەستی تۆڵەسەندنەوە \n\n ٥. پشت بەستن بە کەسانیتر \n\n ٦. نەرێنی بوون  '),
    Motivate(
        motivateText:
            'کات بەم ٣ شتە بەفیرۆ مەدە\n\n  ١. ڕازیکردنی ھەموو خەڵکیچوونکە نایەتە دێ\n\n  ٢.خۆبەراورد کردن بە دەوروبەرچوونکە سوودی نییە \n\n ٣. خەمخواردن لە رابردوو چونکە ناگەرێتەوە'),
    Motivate(
        motivateText:
            'بۆ ئەوەی بە سەرکەوتوویی بمێنیتەوە\n\n ١. بەردەوام متمانەت بەخۆت هەبێت \n\n ٢. هەستی نەرێنی لەخۆت دووربخەوە هەمیشە ئەرێنیبە\n\n ٣. خۆت بەراورد مەکە بە کەسانی تر، بەڵکو گرینگی بەخۆت بدە \n\n ٤. هەمیشە گەشە بە تواناکانت بدە و زانیاری نوێ وەربگرە'),
    Motivate(
        motivateText:
            'چۆن ئامانجەکەت بەدیدەهێنیت؟\n\n ١. قبوڵکردنی شکست و کۆڵنەدان \n\n ٢. پلان دانان و دیاری کردنی کات \n\n ٣. پابەندبوون بەکات و پلانەکان \n\n ٤. هیوای بەردەوام بۆ سەرکەوتن \n\n ٥. دیاری کردنی ئاستەنگیەکان و هەوڵدان بۆ چارەسەرکردنیان \n\n ٦. ئامانجەکەت دیاری بکە و کۆششی بۆ بکە '),
    Motivate(
        motivateText:
            'چۆن وا بکەین ئەوەی کە دەیخوێنین لەبیرمان نەچێتەوە؟\n\n ١. تێگەیشتن\n لەوەی کە دەیخوێنینەوە یارمەتی باشمان دەدات بۆ ئەوەی زانیاریەکامان بیر بمێنێت \n\n ٢. بەستنەوەی\n زانیاریەکان و چواندنیان بە نمونەی بەرچاو وامان لێدەکات کە زانیاریەکان باشتر لە مێشکمان بچەسپێت\n\n ٣. دووبارەکردنەوە\n چەند زانیاریەکان دووبارە بکەینەوە ئەوەندە باشترە بۆ ئەوەی بیرمان نەچێتەوە  '),
    Motivate(
        motivateText:
            'بۆ ئەوەی لە کەسە دڵخۆشەکان بیت\n\n ١. دووربکەوە لە گومانی خراپ \n\n ٢. وەڵامی خراپە بە چاکە بدەوە \n\n ٣. هەمیشە زەردەخەنە بەڕووی خەڵکیدا بکە \n\n  ٤. لێبوردە بە بەرامبەر دەوروبەر \n\n ٥. ئەرێنی بە و گەشبینی بڵاو بکەوە \n\n فێری زانست ببە و ئەوەی دەیزانیت بیبەخشە  '),
    Motivate(
        motivateText:
            '٥ یاسای سادە بۆ ژیانێکی بەختەوەر\n\n ١. ئامانجت هەبێت\n\n  ٢. گۆشەگیر مەبە و گفتوگۆ لەگەڵ خەڵک بکە \n\n ٣. یارمەتی دەوروبەرت بدە \n\n ٤. دڵ و ئەقڵت لە کێشە و ڕق ئازاد بکە\n\n ٥. هەمیشە زانست و زانیاری نوێ فێرببە '),
    Motivate(
        motivateText:
            'ئەوەی کە سەرکەوتووەکان ئەنجامی دەدەن \n\n ١. لە شکست ناترسن و سوودی لێوەردەگرن \n\n ٢. کار بۆ داهاتویان دەکەن \n\n  ٣. هەمیشە بە ئارامی دەمێننەوە \n\n ٤. دڵخۆشن بەسەرکەوتنی ئەوانی تر'),
    Motivate(
        motivateText:
            '٥ ڕێنمایی گرینگ بۆ منداڵەکەت \n\n ١. فێرکردنی بۆ هەڵسان و نووستن لەکاتی خۆیدا\n\n ٢. ڕۆژانە بەبڕی پێویست بخەوێت \n\n ٣. یارمەتی دانی ە ڕۆژانی یەکەمی قوتابخانە \n\n ٤. وا باشترە جانتای قوتابخانەی لە ٪١٠ی کێشی منداڵەکە زیاتر نەبێت\n\n ٥. دڵنیابوونەوە لە سەلامەتی بیستن و بینین '),
    Motivate(
        motivateText:
            'نهێنیەکانی هەبوونی پەیوەندیەکی باش لەگەڵ دەوروبەر\n\n ١. سادەی\n\n ٢. داپۆشینی هەڵەکان \n\n ٣. گومانی باش \n\n ٤. زەردەخەنە \n\n ٥. بڵاوکردنەوەی ئەرێنی بوون \n\n ٦. کرداری باش\n\n  ٧. لێبوردەی \n\n ٨. چاوپۆشی کردن لە هەڵەکان '),
    Motivate(
        motivateText:
            'مێشک و هزرت بەهێز بکە\n\n ١. به‌رده‌وام رووبه‌رووی عه‌قڵت ببه‌وه‌\n\n ٢. بەردەوام ئەو یاریانە بکە کە نەخشەدانانی تێدان\n\n ٣. شارەزایی نوێ پەیدا بکە\n\n ٤.بەردەوام وەرزش بکە\n\n ٥. تێبینیەکانت بە وردی بنووسە \n\n ٦.  پەیوەندی کۆمەڵایەتی جۆراوجۆر دروست بکە\n\n ٧.  خۆت فێری زمانی نوێ بکە\n\n ٨.  لە هەموو زانست وبوارەکاندا بخوێنەوە     '),
    Motivate(
        motivateText:
            'چۆن خۆت لە دڵتەنگی ڕزگار دەکەیت؟\n\n ١. بەردەوام ئەرێنی و گەشبین بە \n\n ٢. دووربە لە گۆشەگیری و تەنیایی \n\n ٣. ڕۆژانە ٧-٨ کاتژمێر بخەوە \n\n ٤. خواردنەوەی بەردەوامی ئاو \n\n  ٥. خۆراکی تەندروست بخۆ \n\n ٦. بەشداری پێکردنی هەستەکانت لەگەڵ کەسوکار و هاوڕێکانت '),
    Motivate(
        motivateText:
            '٥ هۆکار کە دەتکاتە کەسێکی پێشەنگ \n\n ١. قسەکردن بەوپەڕی متمانیەوە \n\n ٢. سوود وەرگرتن لە هەڵەکان \n\n ٣. پاراستنی ئارامیی دەروون \n\n ٤. ئەرێنی بوون و کاریگەری کردنە سەر دەوروبەر \n\n ٥. دووربوون لەکات بەفیڕۆدان و نەرێنی بوون'),
    Motivate(
        motivateText:
            'کاتەکانت بەمانا بە فیڕۆ مەدە\n\n ١. خۆ بەراورد کردن بەکەسانی تر \n\n ٢. بیرکردنەوە و خۆزگە خواستن بە ڕابردوو \n\n ٣. خۆ خەریککردن بە هەڵەکانی ڕابردوو'),
    Motivate(
        motivateText:
            '٧ هێما کە پپێتدەڵێت تۆ لەسەر ڕێگایەکی دروستیت بۆ سەرکەوتن\n\n  ١. کاتەکەکانت بە باشی بەڕێوەدەبەیت \n\n ٢. هەڵەکانت قبوڵ دەکەیت \n\n ٣. خۆت هەڵدەسەنگێنیت\n\n ٤. بەردەوامیت لە هەوڵەکانت و ناوەستیت \n\n ٥. هەر سکاڵا ماکەیت بەڵکو کۆشش دەکەیت \n\n ٦. دەروونت ئارامە \n\n ٧. پلان دادەنێیت بۆ ئامانجەکانت  '),
    Motivate(
        motivateText:
            'منداڵه‌كه‌ت به‌مانه‌ تووشی توڕە‌بوون ده‌بێت\n\n ١. لێدانی منداڵ\n\n ٢. ڕەخنە گرتن لە جێبەجێکردنی کارەکانی\n\n ٣. پشتگوێخستن\n\n ٤. هاتوهاوارکردن بەسەریدا\n\n ٥. بەراوردکردنی بە منداڵانی بەرامبەری\n\n ٦. ململانێیەکانی نێو خێزان \n\n ٧. گاڵتە پێکردن\n\n ٨. باشکردنی منداڵانی تر بەسەریدا  '),
    Motivate(
        motivateText:
            '٦ هۆکار کە وات لێدەکات بەیانیان ئاو لەگەڵ لیمۆ بخۆیتەوە\n\n ١. یارمەتی هەرسکردن دەدات \n\n ٢. یارمەتی دابەزاندنی کێش دەدات \n\n ٣. لەش تێر ئاو دەکات \n\n ٤. توانای مێشک زیاد دەکات \n\n ٥. دەروون ئارام دەکاتەوە \n\n ٦. پەستانی خوێة کەم دەکاتەوە  '),
    Motivate(
        motivateText:
            '٥ ڕێگا بۆ ژیانێکی بەختەوەر\n\n ١. ھەمیشە ئەزموونی نوێ تاقیبکەوە\n\n ٢. بیر لەو شتانە بکەوە کە تۆ ھەتە و ھەموو کەسێک نییەتی\n\n ٣. بە گوێرەی پێویست بخەوە\n\n ٤. ئامانجێکی دیاریکراو دابنێ و ھەوڵی بۆ بدە\n\n ٥. چێژ لە کاتە جیاوازەکانی ژیانت وەرگرە'),
    Motivate(
        motivateText:
            'چەند زیانێکی ئینتەرنێت\n\n ١. ئاڵوودەنوون \n\n ٢. نەفیڕۆدانی کات \n\n ٣. سەرهەڵدانی تاوانی ئەلیکتڕۆنی \n\n ٤. زیانی دەروونی و تەندروستی'),
    Motivate(
        motivateText:
            '٣ یاسا بۆ سەرکەوتن لە ژیان\n\n ١. ئەگەر هەوڵ و کۆشش بۆ ئەو شتە نەدەیت کە دەتەوێت ئەوا پێی ناگەیت\n\n ٢. ئەگەر هەنگاو بۆ پێشەەوە نەنێیت و هەر بیرت لە ڕابردوو بێت ئەوا لە شوێنی خۆت دەمێنیتەوە\n\n ٣. ئەگەر پرسیار نەکەیت و بەدوای زانیاری نەگەرێیت ئەوا وەڵامەکەی هەمیشە "نا" دەبێت'),
    Motivate(
        motivateText:
            'ڤیتامینە پەروەردەییەکان\n بەم ڕامانانە منداڵەکەت فێری ڕاستی بکە\n\n ١. راستگۆیی سه‌ركه‌وتنه‌\n هه‌وڵبده‌ هه‌میشه‌ منداڵه‌كه‌ت فێری ئه‌وه‌ بكه‌، كه‌ راستگۆیی گه‌وره‌ترین سه‌ركه‌وتنه‌ بۆ ژیان و به‌ده‌ستهێنانی مافه‌كان، به‌پێچه‌وانه‌شه‌وه‌ ژیانت تاڵ ده‌بێ\n\n ٢.  راستگۆیی خه‌ڵك خوشیان ده‌وێت\n راستگۆیی بۆ پیناسه‌بكه‌ كه‌ سیفه‌تێكه‌ به‌رده‌وام له‌ناو خه‌ڵك خۆشه‌ویست ده‌بی وكه‌سایه‌تیه‌كی سه‌نگینت پێده‌به‌خشێ وبه‌رده‌م له‌لوتكه‌ی مرۆڤایه‌تی دا ده‌ژی\n\n ٣. حه‌زده‌كه‌م خه‌سڵه‌تی راستگۆیت هه‌بێ\n به‌رده‌وام باسی خه‌سڵه‌تی راستگۆیی بۆ بكه‌ وفێری بكه‌، ودڵی خۆتی بۆ بكه‌وه‌ وپێی بڵێ ده‌مه‌وێت باشترین و راستگۆترین مرۆڤی ئه‌م جیهانه‌ بی\n\n ٤. ووته‌ی زێرینی به‌رامبه‌ر به‌كاربینه‌ وه‌ك: ئافه‌رین چه‌نده‌ راستگۆی، تۆ كه‌سایه‌تیه‌كی راستگۆی، راستگۆی له‌ تۆدا ده‌دره‌وشێته‌وه‌، كه‌سایه‌تی تۆ راستگۆیی نیشانده‌دات...هتد '),
    Motivate(
        motivateText:
            'ڤیتامینە پەروەردەییەکان\nخاڵه‌ سه‌رنجراكێشه‌كان بۆ په‌روه‌رده‌كردنی منداڵه‌كه‌ت\n\n ١. به‌رده‌وام پێی بڵێ متمانه‌م پێته‌\n به‌مه‌ش ئارامی پێ ده‌به‌خشی و هه‌میشه‌ ده‌رونێكی ئارامی بۆ ده‌روخسێت\n\n ٢. رێز له‌ راووبۆچونی بگره‌\n ئه‌مه‌ متمانه‌به‌خۆبوونی لا زیاد ده‌كات، و ده‌توانێت له‌كاره‌كانیدا سه‌ركه‌وتن به‌ده‌ست بهێنێ\n\n ٣. تۆ كه‌سێكی باشی و به‌هره‌مه‌ندی و گۆی له‌ هه‌مو شته‌كانت ده‌گرم به‌مه‌ش گه‌شه‌ به‌ متمانه‌به‌خۆبوونه‌كه‌ی ده‌دات\n\n ٤. لێ بپرسه‌ حه‌ز به‌ چ كار ده‌كه‌ی\n به‌مه‌ منداڵه‌كه‌ت پشتراستده‌بێته‌وه‌ كه‌ تۆ رێزت له‌ رای گرتوه‌وه‌ ومتمانه‌ت به‌كه‌سایه‌تی هه‌یه‌ و ده‌توانێت كاره‌كانی به‌سه‌ركه‌وتووانه‌ ئه‌نجام بدات\n\n ٥. هه‌میشه‌ پێ بڵێ خۆشمده‌وێی و تۆ خێروبه‌ره‌كه‌تی بۆ من، ئه‌مه‌ش هه‌ستی واده‌چوڵێنێ و له‌ رووی عاتفیه‌وه‌ تێرده‌بێت\n\n ٧.  به‌رده‌وام پێی بڵێ تۆ گه‌وره‌ترین ده‌ستكه‌وتی بۆ من هه‌ست ده‌كات كه‌ ئه‌و گرنگ وبڵند وتایبه‌ته‌ لای تۆ'),
    Motivate(
        motivateText:
            'ڤیتامینە پەروەردەییەکان\nخۆشی بخه‌ دڵی جگه‌رگۆشه‌كه‌ته‌وه‌\n\n هه‌ندێك كاری ئاسا بكه‌ بۆ ئه‌وه‌ی ببیته‌ هیوابه‌خشێك بۆ چگه‌رگۆشه‌كه‌ت، رۆژانه‌ كه‌ له‌ماڵ ده‌رچووی منداڵه‌كه‌ت له‌باووشی بگره‌ و خواحافیزی لێبكه\n هه‌میشه‌ به‌گه‌ر‌می پێشوازی لێبكه‌، به‌ تایبه‌تی ئه‌و كاتانه‌ی كه‌بۆ ماوه‌یه‌ك ماڵی چێهیشتووه‌، به‌تایبه‌تر كه‌ رۆژانه‌ ‌ له‌ قوتابخانه‌ هاته‌وه‌ له‌باوه‌شی بگره‌ وبه‌گه‌رمترین شێواز پێشوازی لێبكه‌\n تۆی دایه‌ وبابه‌ هه‌میشه‌ منداڵه‌كه‌ت چاوی له‌ریگاته‌، كاتێك له‌كاره‌كه‌ت گه‌ڕایته‌وه‌ ماڵ به‌ گه‌رمی چگه‌رگۆشه‌كه‌ت له‌باوشیگره‌ و به‌خه‌نده‌وه‌ له‌گه‌ڵی بدوێ‌'),
    Motivate(
        motivateText:
            'رێسای په‌روه‌رده‌یی\n\n ئه‌گه‌ر بێت و له‌به‌رچاوی منداڵه‌كه‌ت هاوكاری هه‌ژارێكت كرد وپێیت به‌خشی، ئه‌مه‌ یه‌كسانه‌ به‌ هه‌زار وانه‌ له‌باره‌ی به‌خشینه‌وه‌ \nئه‌گه‌ر كاغه‌زێك یان لایلۆنێكت له‌به‌رچاوی منداڵه‌كه‌ت له‌ زه‌وی هه‌ڵگرت ئه‌مه‌ یه‌كسانه‌ به‌ هه‌زار وانه‌ی قسه‌كردن'),
    Motivate(
        motivateText:
            'ئەوهۆکارانەی شکست دروست دەکەن\n\n ١. نووستنی لەڕادەبەدەر \n\n ٢. تەمبەڵی \n\n ٣. تووڕەیی \n\n  ٤. ترس\n\n  ٥. بێزاربوون \n\n ٦. دواخستن'),
    Motivate(
        motivateText:
            'چەند ئامۆژگاریەک بۆ بەڕێوبردنی کات \n\n ١. پلانی ڕۆژانە دابنێ\n\n ٢. کۆتاییەک دابنێ بۆ هەر چاڵاکییەک \n\n ٣. رێکخەر بەکاربهێنە لە مۆبایلەکەت \n\n ٤. چاڵاکیەکانت دیاری بکە\n\n ٥. کارە لەپێشینەیەکانت ئەنجام بدە\n\n ٦. کات دیاری بکە بۆ هەر چاڵاکیەک'),
    Motivate(
        motivateText:
            'فێری هونەری خۆ بەڕێوەبردن ببە\n\n ١. گەشبین بە \n\n ٢. خەڵك قبوڵ بکە بەو شێوەی کە هەن \n\n ٣. مەڵێ "ئەستەمە"\n\n ٤. ئاسانکاری بۆ کارەکانت بکە\n\n ٥. کارەکانت دوا مەخە \n\n ٦. دوو دڵ مەبە لە گوتنی "نازانم"\n\n ٧. بەردەوام خۆت هەڵسەنگێنە'),
    Motivate(
        motivateText:
            '٨ خووی ڕۆژانە کە وزەمان بەفیڕۆدەدەن \n\n ١. بیرکردنەوە لە ڕابردوو \n\n ٢. زیادەڕۆی لەبیرکردنەوە\n\n ٣. بەفیڕۆدانی کات لە دراما و زنجیرەکان\n\n ٤. چێژ نەبینین لە ژیان\n\n  ٥. خۆپەیوەستکردن بەقسەی خەڵک\n\n ٦. هاوڵدان بۆ ڕازیکردنی هەموان\n\n ٧. زۆر دانیشتن و وەرزشنەکردن\n\n ڕاڕایی و دوودڵی'),
    Motivate(
        motivateText:
            'چۆن دەگەیت بە ئامانجەکانت\n\n ١. قبوڵکردنی شکستەکان و ڕابردوو \n\n ٢. کۆڵنەدان و بەردەوامی \n\n ٣. پلاندان و ڕێکخستنی کات\n\n ٤. تەرکیز و پابەندبوون بە پلانەکانت \n\n ٥. ئاشنابوون بە زەحمەتیەکان '),
    Motivate(
        motivateText:
            'چەند سوودێکی خوێندنەوەی کتێب\n\n ١. هەستکردن بە ئارامی\n\n ٢. وەرگرتنی زانیاری و ئەزموون \n\n ٣. کەمکردنەوەی ڕاڕایی و دوودلی\n\n ٤. بەرزکردنەوەی لایەنی ڕۆشەنبیری و خۆشبەختی\n\n ٥. تەمەنێکی زیاتر و تەندروستتر'),
    Motivate(
        motivateText:
            'متمانە بەخۆبوونی گەنج\n\nمتمانە بەخۆبوون، ڕۆڵێکی مەزن و سەرەکیی دەبینێ لە سەرکەوتنی هەر کەسێکدا، نەخاسمە گەنجەکان، چونکە گەنج لە تافی گەنجێتیدا زۆر خەون و خولیا و ئامانجی هەیە، هەموو ئەو خەون و ئامانجانەش بەدی نایەن، ئەگەر متمانەیەکی تەواوی بە توانا و شیانەکانی خۆی نەبێت و لەناخییەوە سەرچاوەی نەگرتبێت و لەگەڵ خوێنەکەی ئاوێتە نەبووبێت، \n\n زانایان لەبارەی گرنگی متمانە بەخۆبوونەوە، چەندین وتەی جوان و بەهاداریان هەیە، ئەمانەی خوارەوە مشتێکن لە خەروارێک\n\n ١. (پێشەوا عەلی) لەبارەی متمانەبەخۆبوونەوە دەڵێ: ئەگەر لەگەڵ کاروانی ژیان پێشڤە نەچی بەجێدەمێنی\n\n ٢. (جان ماکسۆل) دەڵێ: ئەگەر خۆت متمانەت بەخۆت نەبێـت، کەس متمانەت پێ ناکات\n\n ٣. (میکل ئانژ) دەڵێ: باشترین یاسای ژیان بریتییە لە متمانە بەخۆبوون\n\n ٤. (ئانتۆنی ڕابینز) دەڵێ: متمانە بەخۆبوون، لە وشیاری و عیزەت نەفسەوە سەرچاوەی گرتووە '),
    Motivate(
        motivateText:
            'ڕێگاکانی بەهێز کردنی یادگە \n\n ١. سەرنج\n\n ٢. لێکدانەوە \n\n ٣. نووسینەوەی تێبینی \n\n ٤. بەستنەوەی زانیاریەکان \n\n  ٥. دووبارەکردنەوە'),
    Motivate(
        motivateText:
            'بەئومێدبوون واتا چی؟\n\nبەئومێــد بوون واتا بوونی تروسکەیەک ھیوا لەنێو جەنجاڵیێکی زۆۆری ژیــاندا، واتا لەدەستدانی خەونێکت و ھەر لەو کاتە ھەوڵدان بۆ خەونێکی تر، بە ئومێد بوون واتا لەوپەری بێ ئومێدی ژیاندا ھێشتا ھیوای خۆشبەختی و بە ئومێد بوونت ھەبێت، بە ئومێد بوون واتا بەخۆت بڵێ من کۆڵ نادەم ئەگەر چیش شکاو بم، بەئومێد بوون واتا تۆ بەکێشەکە گەورەکانت بڵێی من خوایێکی گەورەم ھەیە، بەئومێد بوون واتا لەو پەری بێ ئومێدی ھێشتا چاوەرێی پێکەنین بــیـــت بە ئومێد بوون واتا ھەمیشە بەھێز بیت، بەڵێ لەبیرمان نەچێت خۆراگریش، بە ئومێد بوون واتا پیاسەکردن لە نێو شەقامەکانی خەمدا و ھاوارکردن تێیدا، بڵێیت من سەردەکەوم بۆیە تۆ لە ئێستاوە دۆراوێت، واتا بە خەمەکانت بڵێ ببورە من دڵخۆش دەبم، بەڵێ بە ئومێد بوون تەنھا کاری ئینسانە بەھێزەکانە، ئەوانەی لەنێو سەدان کێشەدا بەیەک خۆشی پێدەکەنن '),
    Motivate(
        motivateText:
            'با خۆمان بناسین\n\n مرۆڤ بەهۆی عەقڵ و ژیریی و ئافراندنەوە لەبوونەوەرەکانی دیکە جیادەکرێتەوە، چونکە مرۆڤ بوونەوەرێکی عاقڵ، داهێنەر، هزرمەند و بەهێزە، بۆیە سەرەتای باسەکەمان بەم پرسیارە دەستپێدەکەین: ئایا ئێمە وەک مرۆڤ، خۆمان دەناسین؟ بەر لە هەر شتێک پێویستە خۆمان بناسین، ئێمە کێین؟ کەسایەتیمان لەڕووی دەروونی و کۆمەڵایەتییەوە چۆنە؟ ئاخۆ ئێمە کەسانی کۆمەڵایەتیین، یان گۆشەگیر و شەرمن؟ پەیوەندیمان لەگەڵ کۆمەڵانی خەڵک و خزم و کەسان و دۆست و برادەران و دەوروبەرمان ئاساییە، یان لەئاستێکی نزم دایە؟ ئایا لەناخی خۆماندا هەمیشە هەست بەخۆشی و بەختەوەری و ئاسوودەیی دەکەین و گەشبینین بەژیان، یان هەمیشە دڵتەنگ و غەمگین و نیگەران و رەشبینین؟ ئایا رێز لە بەها و پیرۆزی داب و نەریتەکانی کۆمەڵگە دەگرین و بە بەرزی ڕایاندەگرین، یان فەرامۆشیان دەکەین و گوێیان پێنادەین؟ ئایا لە کاتی هەڵسوکەوتکردندا لەگەڵ خەڵکانی دیکە، مت و موون و ڕووگرژین، یان لێو بەخەندە و دەم بە پێکەنین و بەشاشین؟ ئایا کەسایەتیمان لەرزۆکە و زوو زوو دووچاری هەڵبەز و دابەزەکانی ژیان دەبین، یاخود خاوەن کەسایەتییەکی خۆڕاگر و جێگیرین و گەردەلووڵ و رەشەباکانی ژیان هەرگیز ناتوانن لەشوێنی خۆمان بمانجوولێنن؟ ئەگەر وەڵامی هەموو ئەم پرسیارانە بزانین و بەشێوەیەکی لۆژیکی و زانستیانە وەڵام بدەینەوە، مسۆگەر هەنگاوی یەکەممان دەبێتە بەردی بناغە بۆ سەرکەوتنمان لەدروستکردنی پردی خۆشەویستی لەنێوان خۆمان و خەڵکدا و وا دەکات کە لە وێستگەکانی ژیاندا سەرکەوتوو بین، چونکە تا خۆمان نەناسین، مەحاڵ و ئەستەمە خوای خۆمان و کەسانی دیکەش بناسین، تا کەسانی دیکەش نەناسین، ناتوانین خوێندنەوەیەکی زانستیانە و مامەڵە و هەڵسوکەوتێکی باش و گونجاو و لۆژیکییان لەگەڵدا بکەین و بچینە ناو دڵەکانییانەوە و ئەم خۆشەویستییە دروست بکەین.بۆیە پێویستە هەموومان سەرەتا لەخۆمانەوە دەستپێبکەین و لە گشت روویێکەوە خۆمان ساز و ئامادە بکەین، بۆ ئەوەی بتوانین لەم گۆڕەپانەدا ئەسپی خۆمان تاو بدەین و لە گشت کایەکانی ژیاندا پێشکەوتوو و سەرکەوتوو بین'),
    Motivate(
        motivateText:
            'زانایی و هۆشمەندیی گەنج\n\n زانایی و هۆشمەندی، بەردی بناغەی سەرکەوتنە، نەخاسمە بۆ چینی گەنج، چونکە گەنجی وشیار و هۆشمەند و زانا، دەزانێ چۆن هەنگاو هەڵگرێ و پلانێکی تۆکمە دابڕێژێ و ئامانجەکانی خۆی دیاری بکات، هەروەها چۆن خوێندنەوەیەکی زانستییانە و بابەتییانە بۆ کەتوار و واقع بکات و سەرەدەرییەکی لۆژیکی و زانستی لەگەڵ بوونەوەردا بکات و ڕێگەی سەخت و دژواری سەرکەوتن بگرێتە بەر و بەرەو بەرزی بکەوێتە ڕێ، زانایان زۆر مەدح و سەنای عیلم و زانستیان کردووە و هانی ئێمەیان داوە بۆ ئەوەی لەدەردی نەزانین و نەفامی دوورکەوینەوە، بۆیە وتراوە: زانست ڕووناکییە و نەزانین تاریکییە! هەروەها وتراوە ئەوەی لە بیری زانست نەخواتەوە، لەبیابانی نەزانیدا بەتینوویێتی سەردەنێتەوە، هەروەها حیجازی دەڵێ:"مرۆڤی زانا تا شوێن پێی خۆی نەبینێ، هەنگاو هەڵناگرێ"، دیسان دەڵێ:"مرۆڤی هۆشمەند، هەموو ڕۆژێک دەکاتە هۆکارێک بۆ بەختەوەربوونی خۆی" '),
    Motivate(
        motivateText:
            'خوێندنەوە\n\n بابەتی خوێندنەوە بابەتێکی فرە هەستیار و بایەخدار و گرنگە، چونکە خوێندنەوە قوتابخانەیەکە بۆ زانا و داناکردن و تێگەیاندن و پێگەیاندنی چین و توێژەکانی کۆمەڵگە، هەروەها مامۆستایەکی دڵسۆزیشە بۆ رزگارکردنمان لەچنگی نەفامی و نەزانی و نەخوێندەواری و کۆڵەواری و بێ ئاگایی و بێ هەستی، گرنگی ئەم پڕۆسەیە بۆ ئێمە وەکو گرنگی خوێنە بۆ جەستە، چونکە بەبێ خوێندنەوەیەکی بەردەوام و سیستەماتیک، ناتوانین لەواتا و مەدلوولەکانی ژیان و بوونەوەر تێبگەین. هەروەها ناتوانین بەشێوەیەکی تەواو و تەندروست بە ئەرکی سەرشانمان هەڵبستین و پیت لەسەر خاڵەکان دابنێین، نەخوێندنەوە لەکوردستان، زەنگێکی بڤە و مەترسیدارە، هەم بۆ خۆمان و هەم نەوەکانی ئاییندەشمان، چونکە ئاییندەی نەوەکانمان پەیوەستە بەئیمڕۆمانەوە، ئەگەر ئیمڕۆ بناغەیەکی مەحکەم و پتەو بۆ نەوەکانمان دانەڕێژین، نەوەکانمان ناتوانن پاشەڕۆژی خۆیان لەسەری بینا بکەن، ئەڵبەتە جیاوازی نێوان کەسی خوێندەوار و نەخوێدنەوار وەکو جیاوازی نێوان (بینا و نابینا) وایە، بەڵام هەر کاتێ کەسی بیناش وەکو نابینا چاوەکانی لەئاست زانست و خوێندن و خوێندنەوە داخست، ئێدی ئەو کاتە هیچ جیاوازییەک لەنێوانیاندا نامێنێ، پێموایە وتەی وێڵ ڕۆجەرز پڕ پێستی خۆیەتی کە لە بارەیەوە دەڵێت: ئەو کەسەی ناخوێنێتەوە، حاڵی باشتر نییە لەو کەسەی نازانێت بخوێنێتەوە، '),
    Motivate(
        motivateText:
            '٨ ڕێنمایی بۆ قوتابیان لەکاتی تاقیکردنەوەکاندا\n\n ١.  به‌ هیوای زۆربه‌، هیوای‌ زۆرت هه‌بیێت و مه‌به‌ستت ده‌رچونێكی‌ نزم نه‌بێت وه‌ هیوات ته‌نها بڕوانامه‌ وه‌رگرتن نه‌بێت\n\n ٢. هیممه‌ت به‌رزی‌، هه‌رگیز بێتاقه‌ت و بێزار مه‌به‌ له‌ خوێندنه‌وه‌ و پرسیار كردن و نوسینه‌وه ‌و داواکردنی زانیاری زیاتر\n\n  ٣. كات دابه‌شبكه‌، وابكه‌ هیچ كاتێكت یان كه‌مترین كاتت به‌ زایه‌ بڕوات\n\n  ٤. هەڵبژاردنی باشترین شوێن، لە شوێنی بێدەنگ بخوێنە و تەنها بیرت لای وانەکانت بێت و هزرت بۆ خوێندن ئامادە بکە، هەوڵ بدە وەڵامی تەلەفۆن و مۆبایل کەم بکەیتەوە یان هەر نەبێت چونکە کاتەکەی ناسکە و ئایندە گرنگترە لە ئێستات\n\n ٥. کاتێک تەرخان بکە بۆ ئارامی دەروونت، وە بیرت لای وانەکانت بێت و کتێبەکەت بەردەوام لات بێت، بۆ ماوەیەکی کەم پیاسە بکە\n\n ٦.  گوێ لە خەم و خەفەت مەگرە و خۆتی پێوە سەرقاڵ مەکە\n\n  ٧. شەو مەکە بە ڕۆژ، ڕۆژیش مەکە بە شەو، هەر کارەو بە کاتی خۆی زیاتر سوودمەند دەبیت \n\n ٨. زۆر خواردن دەبێتە مایەی خەو و بێتاقەتی خواردنی سوک بخۆ لەگەڵ میوە'),
    Motivate(
        motivateText:
            'لە کاتە سەختەکان ئەمانەت لە بیر بێت\n\n ١. لەوانەیە ئەمە دەرفەتێک بێت بۆ ئەوەی بگەیت بە ئامانج\n\n ٢. ھەموو رووداوەکان تاقیکردنەوەن بۆیە پەندیان لێ وەرگرە\n\n ٣. بیرت بێت ئەمە قۆناغێکی کاتیە لە ژیانت و تێدەپەرێت\n\n ٤. ھەمیشە بیر لە ئەنجامی ماندووبونەکانت بکەوە'),
    Motivate(
        motivateText:
            '٧ ھەنگاو بۆ وزەی بەردەوام\n\n ١. ڕێکخستنی کات\n\n  ٢. ئەنجامدانی کارە دڵخوازەکان \n\n ٣. دووربون لە گۆشەگیری \n\n ٣. دوورکەوتنەوە لە کەسانی نەرێنی \n\n ٤.ئەنجامدانی وەرزش \n\n ٥. ھەبوونی ئامانج \n\n ٦. بیرکردنەوەی ئەرێنیانە'),
    Motivate(
        motivateText:
            '٦ ھەنگاو بەرەو خۆشبەختی\n\n ١. بەخشین\n\n ٢. یارمەتیدانی خەڵکی\n\n  ٣. ئەنجامدانی ئەزموونی نوێ\n\n ٣. خوێندنەوەو وەرزشکردن\n\n ٤. وەرگرتنی زانیاری نوێ\n\n ٥. پلاندانان و رێکخستنی کات'),
    Motivate(
        motivateText:
            '٥ یاسا بۆ ژیانێکی باشتر\n\n ١. ئەرێنی بە \n\n ٢. دڵی کەس ئازار مەدە \n\n ٣. متمانەت بەخۆت بێت \n\n ٤. ببەخشە \n\n ٥. لێبوردە بە '),
    Motivate(
        motivateText:
            'ئەم ٥ ھاورێیە لە دەست مەدە\n\n ١. ھاورێیەک کە ئامۆژگاری باشت دەکات\n\n ٢. ھاورێی دڵسۆز\n\n  ٣. ھاورێی تەنگانە\n\n ٤. ھاورێی وەفادار\n\n ٥. ھاورێیەک کە ئومێدت پێ دەبەخشێت'),
    Motivate(
        motivateText:
            'بەختەوەری واتە\n\n ١. دڵخۆشی لە کاتی تەنگانەشدا\n\n ٢. ھەڵنەگرتنی ڕق و کینە لە ناختدا\n\n ٣. ھەمیشە چاوەروانی کاری باشتر بیت\n\n ٤. گەشبین بیت و بە ئومێدەوە لە ژیان بڕوانی\n\n ٥. یارمەتی دانی دەورەبەر\n\n ٦. سەختیەکانی ژیان شکستت پێ نەھێنێ\n\n ٧. ھەبوونی پەیوەندیەکی باش لەگەڵ دۆستان'),
    Motivate(
        motivateText:
            'چۆنییەتی مامەڵەکردن لە کاتی توورەیدا\n\n ١. ھەناسەدانی قووڵ \n\n ٢. دوورکەوتنەوە لە شوێنی رووداوەکە\n\n ٣. دوورکەوتنەوە لە ھەڵچوونی زیاتر\n\n ٤. ئارامبوونەوە\n\n ٥. گفتووگۆ کردن لەگەڵ دەروون'),
    Motivate(
        motivateText:
            'سەرکەوتوەکان\n\n  ١. خۆیان بە پلانەکانیان سەرقاڵ دەکەن \n\n ٢. یارمەتی کەسانی تر دەدەن بۆ سەرکەوتنیان \n\n ٣. ھانی دەوروبەریان دەدەن'),
    Motivate(
        motivateText:
            'شکستخواردووەکان\n\n ١. خۆیان بە خەڵک سەرقاڵ دەکەن\n\n ٢. ئامانجیان شکست پێھێنانی کەسانی دەوروبەرە\n\n  ٣. بەردەوام رەخنە دەگرن'),
    Motivate(
        motivateText:
            '٥ ڕێنمایی بۆ زیاد کردنی تەرکیز لەکاتی خوێندن لە ڕەمەزاناندا\n\n ١. دانانی پلان و پابەندبوون \n\n ٢. دانانی پاداشتێکی ھاندەر\n\n ٣. کەمکردنەوەی کۆبوونەوە خێزانییەکان\n\n ٤. گرینگیدان بە ئاو و نووستنی پێویست\n\n ٥. ژەمی خۆراکی باش و تەندروست'),
    Motivate(
        motivateText:
            '٦ کرداری ڕۆژانە کە وزەمان بە فیڕۆ دەدەن\n\n ١. نەبوونی ئامانجێکی ڕوون\n\n ٢. نەبوونی پلان\n\n ٣. پشت بەستن بە ژەمە خێراکان\n\n ٤. نەخواردنەوەی بڕی پێویستی ئاو \n\n ٥. کارکردنی بەردەوام و پشوونەدان\n\n ٦. پشتگوێخستنی ژەمی بەیانیان'),
    Motivate(
        motivateText:
            '٨ ڕێگا بەرەو سەرکاوتن \n\n ١. دووربکەوە لە خۆ بەگەورە زانین \n\n ٢.بەردەوام سەیری پلانەکانت بکەوە و باشتریان بکە\n\n  ٣. ھاوڕێیەتی کەسانی ئەرێنی و گەشبین بکە\n\n ٤. دوور بکەوە لە بەھانە ھێنانەوە\n\n  ٥. دوور بکەوە لە کەسانی  نەرێنی و ڕەشبین \n\n ٦. دەسکەوتەکانی ڕابردووت لەبیر مەکە \n\n ٧. کات یەکێکە لە ئامرازە سەرەکییەکانی سەرکەوتن \n\n ٨. کەوتن ئاساییە ، ھەڵسانەوە گرنگە '),
    Motivate(
        motivateText:
            'بۆ ئەوەی کەسێکی کاریگەر بیت\n\n ١. ڕاستگۆبە \n\n ٢. خاوەن بڕیار بە\n\n ٣. یارمەتی کەسانی دەورووبەر بدە\n\n ٤. ببەخشە\n\n ٥. ھەوڵبدە ژیانی خەڵک بگۆڕیت بۆ باشتر\n\n ٦. دڵسۆز بە بۆ کارەکەت\n\n ٧. خاوەن بیرۆکەی نوێ بە'),
    Motivate(
        motivateText:
            '٥ ھەنگاو بۆ دوور بوون لە تووڕەیی\n\n ١. جوینی بنێشت \n\n ٢. خوێندنەوەی کتێب\n\n ٣. ئەنجامدانی وەرزش\n\n ٤. خواردنی ھەنگوین\n\n ٥. دوورکەوتنەوە لە گفتوگۆی بێ سوود'),
  ];
  void nextMotivate() {
    if (_motivateNumber < _motivateBank.length - 1) {
      _motivateNumber++;
    }
  }

  void previousMotivate() {
    if (_motivateNumber != 0) {
      _motivateNumber--;
    }
  }

  String getMotivateText() {
    return _motivateBank[_motivateNumber].motivateText;
  }

  bool isFinished() {
    if (_motivateNumber >= _motivateBank.length - 1) {
      print('Now returning true');
      return true;
    } else {
      return false;
    }
  }

  void reset() {
    _motivateNumber = 0;
  }
}
