import 'Data.dart';

class Tech {
  int _techNumber = 0;
  List<Technologya> _techBank = [
    Technologya(
        technologyText:
            'ڕوم\n\n  بریتیه‌ له‌ پارچه‌یه‌کی بچوک که‌ له‌سه‌ر بۆردی دایک جێگیرکراوه‌ ، وه‌ هه‌ر سێ پیتی (ROM) که‌ بۆ ناوی ئه‌م پێکهاته‌ ده‌نوسرێت له‌ سێ ووشه‌ی (Read Only Memory) وه‌ وه‌گیراوه‌ که‌ به‌واتای (بیره‌وه‌ریه‌ک که‌ ته‌نها ده‌خوێنرێته‌وه‌) دێت ، ڕوم به‌رهه‌م ده‌هێنرێت له‌ لایه‌ن هه‌مان کۆمپانیای به‌رهه‌م هێنه‌ری مه‌زه‌بۆرده‌که‌وه‌ ، هه‌ر له‌لایه‌ن ئه‌وانیشه‌وه‌ پرۆگرام ڕێژ ده‌کریت (بایۆسی) له‌سه‌ر جێگیر ده‌کرێت'),
    Technologya(
        technologyText:
            'ڕام\n\n بریتیه‌ له‌ پێکهاتوێکی وێنه‌ شانه‌یی که‌ له‌سه‌ر مەزەربۆرد شوێنی تایبه‌تی هه‌یه‌و له‌ وانه‌یه‌ له‌ بۆردێکدا زیاد له‌ دوو شوێن هه‌بێت بۆ ئه‌م هاردوێره‌، هه‌ر سێ پیتی (RAM) که‌ بۆ ناوی ئه‌م پێکهاته‌ ده‌نوسرێت له‌ سێ ووشه‌ی (Random Access Memory) وه‌ وه‌رگیراوه، ده‌کرێت بگۆڕێت و هه‌ندێک جار له‌سه‌ر مەزەربۆرد زیاد له‌ چوار ڕام له‌ یه‌ک کاتتدا جێگیر ده‌کرێت، ڕام کاری سه‌ره‌کی بریتیه‌ له‌ هه‌ڵگرتنی هه‌ندێک داتا به‌ شێوه‌یه‌کی کاتی یاخود به‌رهه‌می به‌رنامه‌کانه‌ له‌ کاتێکدا به‌کارهێنه‌ر کاریان له‌سه‌ر ده‌کات.'),
    Technologya(
        technologyText:
            'هارد دیسک چیە ؟\n\n هارد دیسکی کۆمپیوتەر بەرپرسە لە خەزنکردن و هەڵگرتنی تەواوی داتا و زانیار و فایلەکانی ناو کۆمپیوتەر بەشێوەیەکی هەمیشەی، لە بواری وەبەرهێناندا تەکنۆلۆژیا و میتۆد و کواڵتی جیاواز بەکار دەهێنرێت بۆ دروستکردنی هارد دیسکەکان، هارد دیسکەکان بە ڕەنگی جیاواز دروست دەکرێن و هەر ڕەنگەو توانایەکی تایبەت بەخۆی هەیەو بۆ بوارێکی تایبەت دروست دەکرێت'),
    Technologya(
        technologyText:
            'هاڕدی ئێچ دی دی (‌HDD)\n\n ناوی Hard Disk Drive\n  ـه‌ که‌ ئه‌مه‌ وه‌ک بیرگه‌یه‌ک به‌کار دێت له‌ کۆمپیوته‌ر، پێک دێت له‌ په‌پکه‌یه‌ک که‌ له‌سه‌ر ته‌وه‌رێک ئه‌خولێته‌وه‌، له‌گه‌ڵ ئامێرێک له‌ شێوه‌ی ده‌رزی که‌ زانیاریه‌کانی سه‌ر ئه‌و په‌پکه‌یه‌ ئه‌خوێنێته‌وه‌'),
    Technologya(
        technologyText:
            'هاڕدی ئێس ئێس دی(SSD)\n\n ناوی Solid State Drive\n که‌ ئه‌میش به‌هه‌مان شێوه‌ وه‌ک بیرگه‌یه‌ک به‌کار دێت له‌ کۆمپیوته‌ر، په‌پکه‌ و دەرزى بوونى نييە لەو جۆرە هاردانە، بەڵكو زانيارێكان لەسەر چيپێکی بچووك زەخيرە ئەكرێت، كەواتە ترسى تێكچوونى زۆر كەمترە لە (ئێچ دی دی) و وە خێرایەکەشی ١٠هێندە یان زیاترە لە (ئێچ دی دی)'),
    Technologya(
        technologyText:
            'پڕۆسێسەر\n\n  یەکەى چارەسەرى ناوەندى CPU کورتکراوەى Central Processing Unit یان processor،بەرپرسیارە دەربارەى زۆربەى فرمانەکانى کۆمپیوتەر چى کاڵاڕەق یان کاڵانەرم بێت،هەموو یەکەى چارەسەرى ناوەندى وەک یەک نییە،جیاوازى هەیە لە ڕووى خێراییەوە وە لە ڕوورى (پین) ـەکانەوە جیاوازى هەیە، لەڕێگاى (پین) ـەکانەوە جێگیر دەکرێت لە تەختەى سەرەکى کۆمپیوتەر، ئەمیش دوو کۆمپانیای سەرەکیمان هەیە ئینتێل و ئەی ئێم دی ئەوەی دووەم پرۆسێسەر و هەمیش گرافیک کارد دروست دەکات'),
    Technologya(
        technologyText:
            'یەکەى چارەسەرى گرافیکی GPU چییە لە کۆمپیوتەر؟\n\n یەکەى چارەسەرى گرافیکی GPU کورتکراوەى Graphics Processing Unit :\n ئەرک و فرمانی سەرەکی ئەوەیە کە گرافیک و کواڵتی شاشەی کۆمپیوتەرەکە باشتر بکات بە کاتی کەمتر لە پڕۆسیسەر بەڵام لە ناوەند و ئاستی خێرای دا زۆر خێراترە کە لە هەزارەها ناوەندی خێرای پێکدێت ، کارتی شاشە پڕۆسیسەرێکی تایبەتە بە گرافیک بۆ پیشاندانی ڤیدیۆ و پیشاندانی یاریە ڤیدیۆکان و کارە گرافیکیەکان، \n\n دوو کۆمپانیای سەرەکیمان هەیە کە گرافیک کارد بە تایبەت دروست ئەکەن لەوانە کۆمپانیای ئەی ئێم دی و کۆمپانیای ئینڤیدیا'),
    Technologya(
        technologyText:
            'مەذەڕبۆڕد چییە؟\n\nلە گرینگترین بەشى کۆمپیوتەر، لەڕێگاى مەزەربۆرد هەموو پارچەکانى کۆمپیوتەر دەبەسترێتەوە بەیەکەوە وەک سی پی یو و گرافیک کارد و هارد درایڤ هیتر و لە ڕیگای مەزەربۆردەوە بۆ گشت پارچەکان وزه‌ی پێویستیان پێ ده‌گات و فرمانیان ئاراسته‌ ده‌كرێت و هاوكات فرمانیش له‌ به‌شه‌ جیاوازه‌كانه‌وه‌ وه‌ده‌گرێت و ئاراسته‌ی به‌شی مه‌به‌ستی ده‌كه‌نه‌وه‌ '),
    Technologya(
        technologyText:
            'پاوەڕ سەپپڵای \n\n یەکەی پیدانی وزە "پاوەڕ سەپپڵای" بریتیە لە ڕەقە کاڵایەک وزەی هاتوو دەگۆرێت بەشێوەیەک بگونجێت بۆ بەکارهینانی گشت بەشەکانی كۆمپیوتەر، وزەی هاتوو دەگۆرێت لە وزەی گۆراو بۆ وزەی بەردەوام کە راستەخۆ لە گشت بەشەکانی کۆمپیوتەر بەکاردیت و هەڵدەستێت بە کۆنترۆل کردنی پلەی گەرمی بە پێی هەبوونی وزە'),
    Technologya(
        technologyText:
            'مۆنیتەر چییە؟\n\n ڕەقە کاڵایەکە توانای پیشاندانی ڤیدیۆ ، نەرمەکاڵاکانی هەیە ، پێکهاتووە لە ڕوونماێەک و کۆمەڵێک ترانسیستیر، چەند جۆرێکی هەیە وەک\n ئێڵ سی دی، ئێڵ ئی دی، ئۆ ئێڵ دی و سی ئاڕ تی'),
    Technologya(
        technologyText:
            'ماوس چییە؟\n\n ماوس یان مشک ئامێرێکە وەک مشک وایە کە لە ریزی کەل‌وپەلی کۆمپیوتەر دادەنرێت. ماوس وەکو ڕەقەکاڵا‏یی دێتە ھەژمار. ئەم ئامێرە بە کەیبڵ یان وایەرلێس بە کۆمپیوتەرەوە دەبەسترێت . لە نەرمەکاڵاکانی ئەوڕۆدا ماوس بەشی زۆری ئەرکەکانی تەختە کلیل "کیبۆرد" لە ئەستۆ دەگرێت'),
    Technologya(
        technologyText:
            'ڕاوتەر چییە؟\n\n ڕاوتەر: بریتیە لە ئامێری تۆرەکان کە پاكێتی زانیاریەکانی لە نێو تۆرەکان دەگوازنەوە لە ئامێرێکەوە بۆ ئامێرێکی دی'),
    Technologya(
        technologyText:
            'ڕاژەکار "سێرڤەر"چییە؟\n\n بریتیە لە ئامێرێک تایبەت کە بە شێوەیەکی بەردەوام بەستراوەتەوە بە تۆڕی ئەنتەرنێتەوە بۆ ھەموو بەشداربووانی ئەنتەرنیت لە ھەموو جیھاندا وە لکێنراوە ، بۆ ئەوەی گشت بەژداربوان سود لە زانیاریەکان ببین و بەکاربێنن'),
    Technologya(
        technologyText:
            'بازدەرەکان \n\n بازدەرەکان بەشێکن لە ناو تەختەی سەرەکی "مەذەڕبۆڕد" کە ڕێگە بە کۆمپیوتەر دەدەن کە تەزووی کارەبا بپچڕێنێت، و تەزوو بەو بەشەدا بڕوات کە کۆمپیتەر فەرمان دەکات و بە گشتی بۆ ڕێکخستنی ئەو پارچانە بەکاردێت کە پەیوەستدەکرێن بە تەختەی سەرەکی "مەذەڕبۆردەوە"وە وەک درایڤە ڕەقەکان، مۆدێم و فلاشەکان و کارتی دەنگ، بازدەرەکان، لە چەند دەزوولەیەک پێکدێن بە سندوقێکی بچوکی پلاستیک کە پێی دەگوترێت(بلۆکی بازدەر) دادەپۆشرێن و لە پەنای هەر دەزوولەیەک بە ڕوونی وردەکاری هەر دەزوولەیەک بە جیا نوسراوە، دەزوولەی ١-٢ بۆ دۆزی ئاساییە، دەزوولەی ٢-٣ بۆ ڕێکخستنە و دەزوولەی کراوەش کاتێک کۆمپیوتەرەکە دەکەیتەوە دەکەوێتەوە سەر ئەو دۆخەی کۆمپیوتەرەکەی تێدا کوژاوەتەوە'),
    Technologya(
        technologyText:
            ' ڤایرۆسی کۆمپیوتەر بۆ دروست دەکریت؟\n\n پرۆگرامسازەکان ھەڵدەستن بە دروستکردنی ئەم پرۆگرامە بەتوانایانە کە توانای کۆنترۆلکردن ودزەپێ کردنی زانیارییەکانی ھەیە یان لە رێگەی کۆمپانیاکانەوە دێتە بەرھەم ئەمەش دەگەرێتەوە بۆ زۆر ھۆ لەوانە: بازرگانی، تەکنەلۆژی، سەربازی، ..هتدو ھەندێک لە پرۆگرامسازەکانی ئەم بوارە تەنھا وەکو ھونەر خوو بەکارەکەوە دەگرن یەکێک لە گرنگترین ئامانجەکانی دروستکردن و بڵاوکردنەوەی ڤایرۆس بۆ ئامانجی بازرگانییە ئەمەش بە دروستکردنی ڤایرۆس ولەناوبەری ڤایرۆسیش چونکە دوای ئەوەی کە ڤایرۆسەکە بڵاودەبێتەوە ئەو کات بەکار بەر پێویستی بە بەرنامەی دژە ڤایرۆس دەبێت بۆ لەناودان و خۆ رزگارکردن لە ڤایرۆس'),
    Technologya(
      technologyText:
          'ئایا ڕام بەرپرسە لە خێرایی مۆبایلەکان؟\n\n زۆربەی بەکارهێنەرانی مۆبایل و تایبەت هاوادارانی یارییە ڤیدیۆکان زۆر گرنگی بە زۆری ڕام دەدەن وەکو ئەوەی ڕام بەرپرس بێت لە خێرایی مۆبایلەکان، بۆ چوونیان وایە ڕامێکی زۆری هەبوو\n خێرادەبێت و ڕامێکی کەمی هەبوو خاوترێکە،بەڵام لە راستیدا ڕام هیچ پەیوەندییەكی\n راستەوخۆی نییە لەگەل خێرای مۆبایلدا، بەڵكو ئەوەی بەرپرسە لە خێراییەكەی (چیپە) یاخود (سی پی یو) كە بە مێشکی مۆبایل ناسراوە',
    ),
    Technologya(
        technologyText:
            'جاڤا چییە؟\n\n جاڤا زمانێکی بەرنامە داڕشتنی ئاست بەرزە کە لە لایەن (جەیمس گۆسلینگ) دایهێنا کە لە کۆمپانیای سەن ئیشی ئەکرد، ساڵی ١٩٩٥ کۆمپانیای سەن یەکەم وەشانی جاڤای بڵاوکردەوە کۆمپانیای ئۆڕاکڵ پاش کڕینەوەی سەن (لە ڕێکەوتی ٢٧/١/٢٠١٠ دا)، بۆتە خاوەنی ئەم زمانە و سەرپەرشتی تەواوی دەکات'),
    Technologya(
        technologyText:
            'پایثۆن چییە و کەی دروست کراوە ؟\n\n زمانی بايثون لە لایەن - جويدو فان روزوم - لەسەرەتای ٨۰ـاکان دەست بەکاربوون بۆ دروست کردنی و ساڵی ۱۹۹۱بە تەواوی خرایە کار و کاری پێ کرا ، جويدو فان روزوم زانستەکانی کۆمپیوتەری لە ئەمستردام تەواو کردووە ، بايثون بە زمانی سی داڕێژراوە، زمانێکی ئاست بەرزە و لەسەر تەکنیکی (ئۆ ئۆ پی) کردارەکانی ئەنجام ئەدات'),
    Technologya(
        technologyText:
            'زمانی سی چییە و کەی دروست کراوە؟\n\n زمانی سی زمانیکی جیهانیە و سەرتاکانی ۷۰ـاکان ئەم زمانە داهێنرا لە لایەن " كین تۆمسۆن، براين كرنيگان، ودينێس ڕیچی" لە ڕاستیدا دروست کرا تاکو کاری پێ بکرێ لە ژێر سیستەمی یۆنیکس دا ، بەڵام دواتر بە شێوەیەکی بەرچاو گەشەی سەند و لە لایەن زۆرێک لە پرۆگرام سازەکان کاری پێ کرا ، زمانی سی ئەو زمانەیە کە هەردوو زمانی سی پڵەس پڵەس و جاڤای پێ بنیاد نراوە'),
    Technologya(
        technologyText:
            'سی پڵەس پڵەس چییە؟\n\n بە سی پڵەس پڵەس ئەخوێندرێتەوە و بيارن ستروستروب گەشە پێدەری ئەم زمانەیە، سی پڵەس پڵەس ئەو زمانی پرۆگرام سازیەیە کە بۆ جۆرەها کار بە کار دێت و بە تەواو کەری زمانی سی دادەنرێت ، زۆرینەی پرۆگرام سازەکان بەباشترین زمانی دا دەنێن بۆ مامەڵە کردن لە گەڵ پرۆگرامە ئاڵۆزەکاندا وە مامەڵە کردن لە پێکهاتە رەقەکانی کۆمپیوتەردا ئەمەش بە هۆی ئەوەی کە لە جێبەجێ کردنی فرمانەکاندا خێرا ترە و جیاوازێکی زۆری نیە لەگەڵ\n زمانی سی دا'),
    Technologya(
        technologyText:
            'کۆمپایلەر؟\n\n وەرگێڕە پڕۆگرامێکە کە سۆرس کۆد دەگۆڕێت بۆ کۆدی مەکینە، ئەو زمانەی کە ئامێری کۆمپیوتەر لێی تێدەگات ، بۆیە پرۆگرمەراکان بە کاری دێنن بۆ ئاسانکردنی کارەکانیان'),
    Technologya(
        technologyText:
            'داتا بەیس چییە؟\n\n ریتیە لە بانکێکی زانیاری ، زانیارییەکان بە شێوەیەکی ڕێکوپێک پۆلێنکراون و تێیدا هەڵدەگیرێن. داتابەیس لەلایەن پرۆگرامۆکەکانی وێب و\n پرۆگرامی سەر سیستمەوە بەکار دەهێندرین لە ساڵی ١٩٦٠ (چاڕکێس و. باچمان ) یەکەم بنکەی زانیاری دیزاین کرد'),
    Technologya(
        technologyText:
            'داتا سترەکچەر چییە؟ \n\n ڕێگایەکی تایبەتە بۆ هەڵگرتن و ڕێکخستنی بابەتی دراوە (ڤاریەبڵ) لە کۆمپیوتەردا بە جۆرێک کە بتوانرێ بەشێوەیەکی کارامە بەکار بھێنرێتەوە'),
    Technologya(
        technologyText:
            'پرۆگرامکردن\n\n پرۆگرامکردنی کۆمپیوتەر یان بەرنامەسازی بریتییە لە پرۆسەی دیزاین و دروستکردنی پرۆگرامێکی (وەگەڕخراو) بۆ جێبەجێکردنی ئەلگۆریتمێکی کۆمپیوتەر، دیاریرکردنی ئاستی دروستیی ئەلگۆریتمێک و وەگەڕخستنی سەرچاوە و جێبەجێکردنی ئەلگۆریتمەکە بە زمانێکی پرۆگرامکردنی تایبەت، لە زمانی ئینگلیزیدا وشەی (کۆدینگ) باوترە و لە کوردی سۆرانیشدا بڵاوە، مانای بەرنامەسازیی کۆمپیەتەر لە زاراوەی گشتیدا دەتوانرێت بە ھەموو پرۆسەی پەرەپێدانی نەرمامێر (سۆفتویەر دڤیلۆپمێنت)، بوترێ کە بریتییە لە چالاکیگەلێکی جیاواز وەکوو تاوتوێکردن، پەرەپێدان، فامکردن، داڕژتنی ئەلگۆریتم، جێبەجێکردن، تاقیکردنەوە، ھەڵەدۆزی و پاراستنی نەرمامێرەکان، کۆدی ژێدەری ھەر بەرنامەیەک بە زمانێکی بەرنامەسازی یان زیاتر دەنووسرێت کە بەرنامەسازەکان توانای لێتێگەیشتنیان ھەیە و خێراتر لە کۆدی مەکینە (کە لەسەر بنەمای سفر و یەکە) و ڕاستەوخۆ بەدەستی یەکەی ناوەندی پێواژۆیی ئیجرا دەبێ لێی تێ دەگەن، مەبەستی بەرنامەسازی دۆزینی زنجیرەیەک فەرمانە کە ئیجراکردنی ئەرکێک لەسەر کەمپیوترێکدا خۆکار دەکا، کە دەتوانێ ھێندەی سیستمی بەکارخەری ئاڵۆز بێ، دەزگا بەرنامەپەژرێنەکان چەند سەدەیە کە بوونیان ھەیە. لە ڕۆژھەڵاتی ناوین، لە سەدەی ٩یەمدا سێ برا ئێرانییەکە کە ناسراون بە کوڕانی مووسا دەزگایەکی بەرنامەپەژرێنی مۆسیقایان داھێنا، کە لە کتێبی دەزگا بلیمەتەکاندا ( کتاب الحیل) پەخشکەرێکی فلووتی مەکینەیی وەسف دەکرد'),
    Technologya(
        technologyText:
            'ئەلگۆریزم چییە؟ یەکێکە لە گرنگترین چەمکەکانی تەکنەلۆژیایە ، بریتییە لەکۆمەڵێک یاسا و ڕێسا ، پڕۆسەیەکی ھەنگاو بە ھەنگاوە کە دەرەنجامی چارەسەر کردنی کێشەیەک دەبێت، ژمارەی ھەنگاوەکانی ئەلگۆریزم دەبێ لە ژمار بێت واتە بێکۆتا نەبێت، ناوی ئەلگۆریزم لە ناوی ئەلخوارەزمی زانای موسڵمانەوە وەرگیراوە'),
    Technologya(
        technologyText:
            'جی پی ئێس چیە ؟ \n\n كورتكراوەی هەرسێ ووشەی Global Positioning System لە ئێستادا خاوەندارێتی ئەم پرۆژەیە ئەمریكایە چونكە زانای گەورەی فیزیایی (فرێیدوارت وینتەربێرگ) كە بەڕەگەز ئەڵمانیە پێشنیاری خستنە گەڕی كارەكەی لە ئەمریكادا كردوە و مێژوی بیرۆكەكەش دەگەرێتەوە بۆ ساڵی ١٩٥٦ بەهۆی شەپۆلی مایكرۆ وەیڤەوە بە لەرەلەرێكی بەرز بناغەی كارەكەی داڕێژراوە ، بۆ جێ بەجێكردنی ئەم پرۆژەیە وا پێویست دەكرا لە ئاسمانەوە چاودێری ڕوبەرێك لە جوگرافیای زەوی بكرێت هەتا بتوانرێت زانیاری دەربارەی ئەو ڕوبەرە كۆبكرێتەوە ئەم كارەش ئەگەر بەهەمیشەیی بێت كەوایە پێویست بوو مانگی دەستكرد كارەكەی بگەیەنێت بە ئەنجام'),
    Technologya(
        technologyText:
            'کۆدی (کیو ئاڕ) چی یە؟\n\n بریتیە لەجۆرێکی  بارکۆدی دوو ئەندازەیی ، بەکاردێ بۆ خێرا و ئاسان دەست گەیشتن بە زانیارییەکان لەڕێگەی ئامێرەکان بەتایبەت ئامێرە زیرەکەکان، ئەم جۆرە کۆدە، کورتکراوەی(کویک ریسپۆنسە) ە ،بەکوردیەکەی دەبێتە " کۆدی خێرا وەڵامدەرەوە لە ساڵی ١٩٥٢ خراوەتە ناو داهێنان نامەکان، "نۆرمان جۆسێف وودلاند " بە خاوەنی بیرۆکە و داهێنانی ئەم تەکنەلۆژیایە دادەنرێت '),
    Technologya(
        technologyText:
            'زمانی پڕۆگرامسازی چییە؟\n\n لەگەڵ دروستبوونی کۆمپیوتەردا لە ساڵی ١٩٤٠ ــەکان زمانی پرۆگرامسازی\n دروست بوو کە بریتیە لە جۆرە زمانێکی ئاڵۆز کە پێی دەوترا زمانی ماکینەی(مەشین لانگویچ) ئەم جۆرە لە زمانی پرۆگرامسازی پێکهاتووە تەنها لە -سفر و یەک- وە لەڕێگەی ئەو دوو ژمارەیەوە کۆمپیوتەرەکە کۆنترۆڵ دەکرا، پاش چەند ساڵێک کۆمپیوتەرزانەکان هەستان بە دانانی زمانێکی ئاسانتر بۆ کەم کردنەوەی ئەم ئاڵۆزیە کە ناوی زمانی پەرتکراو (ئەسێمبڵێ لانگویج) ئەویش بە سیمبول کردنی فەرمانەکانە بۆ نمونە لەکاتی کۆکردنەوەی دوو ژمارەدا لە پێشدا فەرمانی (ئادد) دەنوسیت پاشان دوو ژامرەکە یاخود ئەو دوو خانەی بیرگەیە کۆ بکەیتەوە کە دەتەوێت، هەرچەندە تا ڕادەیەک ئەمە پێشکەوتوو تر بوو لەچاو زمانی مەکیینەیدا وەلێ هێشتا هەر ئاڵۆزبوو بۆ نوسینی پرۆگرامێکی گەورە لەلایەن پرۆگرامسازەکانەوە، بۆیە جۆرە زمانێکی تر پەیدا بوو کە ناوی لێنرا زمانی ئاست بەرزی پرۆگرامسازی،  لێرەشەوە زمانی پرۆگرامسازی پێشکەوتنێکی هێجگار گەورەی بە خۆیەوە بینی وەک پەیدابوونی زمانی تەنخواز\n\n  (Object Oriented Programming)'),
    Technologya(
        technologyText:
            'مەشین لێرنینگ چیە؟\n\n زانستی ڕۆبۆتینگە تیایدا ئامێرەکە کارێکت بۆ ئەکات یان چەند کارێک کە ئەتوانرێ سودی زۆر باشی لێ وەربگیرێت وەک و ئامێرەکانی ناسینەوەی دەموچاو ، دەنگ ، بایۆمێتریک و زۆری تر پاشان لە بەکارهێنانی نەخۆشخانەکان سودی زۆری هەیە کە ئەتوانێ نەخۆشیەکان و جۆرەکانیان دیاری بکات دوو جۆری هەیە \n\n ١. سوپەرڤایسد\n لەم بەشەدا پێویستە پڕۆگرامەر پڕۆگرامی هەموو بەشەکان بکات بە وردی و لێرەدا زیرەکی ئامێرەکە سنووردارە\n\n ٢. ئەن سوپەرڤایسد\n لێرەدا پڕۆگرامەرەکە یەکجار بەس بەشێوەیەکی زۆر تۆکمە پڕۆگرامی ئەکات و وای\n لێ ئەکات ڕۆبۆتەکە خۆی شتەکان تاقی بکاتەوە و فێریان ببێت ، بەبەکارهێنانی سێرڤەرێک کە پڕ بێت لە زانیاری کە خۆی سێرچ بکات تا بزانێت پێویستە چی بکات لێرەدا زیرەکی ڕۆبۆتەکە سنووردار نییە و فێری هەمووشتێک ئەبێت'),
    Technologya(
        technologyText:
            'ڕەن سەن چییە؟ \n\n رەن سەم جۆرێکە لە ڤایرۆس کاتێک تووشی کۆمپوتەرەکەت دەبێت دەبێتە هۆی تشفیر کردنی هەموو فایلەکان بەشێوەیەک کە فایلی اسڵی دەسڕێتەوە لە جێگەی هەمان فایل دروست دەکاتەوە بە هەمان ناو بەڵام پاشگرێک بۆ فایلەکان دروست دەکات پێشتر بە جۆرێکی زۆر سادە دروست دەکرا بەشێوەیەک بوو کە تووشی کۆمپوتەرەکەت دەبوو راستەو خۆ بەرنامەکە لەسەر کۆمپوتەرەکەت بە دیار دەکەوت واتە ئەوە بەرنامەی کە ڤایرۆسکەیە بەشێوەی ڕاستەوخۆ لەسەر کۆمپیوتەرکەت دەرکراوە داوای کلیلێکی دەکرد بۆ کردنەوەی فایلەکان ئەمە هەر زوو توانرا کلیلی بەرنامەکە ئاشکرا بکرێت چارەسەر بکرێت بەڵام ئێستا سەریان پێداوە بە جۆرێکە کە فایلەکان تەشفیردەکات هەرکۆمپوتەرێک ئایدی تایبەت بەخۆی دروست دەکات دەی نێرێت بۆ خاوەن ڤایرۆسکە وە بەرنامەی کردنەوەی تەشفیرەکە و کلیلەکە تەنها لای دروست کەرەکەی هەیە بەڵام دروست کەرەکەی لەکاتی تووش بوونی ڤایرۆسەکە فایلێکی تێکست لە کۆمپیوتەرکەت بە جێ دەهێلێت بۆ ئەوە پەیوەندی پێوە بکە کە ئیمەیل کەس دروست کەر جەند زانیاریەکی تێدایە دواتر لێ دەکات پەیوەندی پێوە بکە لەماوەیەکی دیاری نرخی دیاری کراوە ئەگەر ماوە دیاری کراوە پەیوەندی نەکەی دوای زۆرتر دەکات بۆ کردنەوەی مەلەفەکانت وە پارەکەیش دەبێت بە بت کۆین بۆی بنێری بۆئەوەی نادۆزرێتەوە چونکە ئەگەر بە ئەژماری بانکی بێت کەشف دەبێت بۆچی تووشی دەبین ؟ زۆربەی جار بەهۆی دابەزاندنی کاراکی بەرنامەکان وە دەبێت بەتایبەتی ئەو بەرنامانەی کەوا زۆر نوێن کاراکیان نیە کاتێک دەگرێت بۆ کاڕاکەکیان ئەوە کڕاکێکی دەست دەکەوێت دروستکراوە بۆ تووش بوون بەو ڤایرۆسە کاتێک دای دەبەزێنێ و لە کۆمپیوتەرکەت کلیکی لێ دەکەی کاری ڤایرۆسکە دەست پێ دەکات زۆر بەی جار کۆمپیوتەرکەت لەناکاو دەست دەکات بە ئەپ دەیت کردن تۆ وادەزانی ئەپ دەیت دەکات بەڵام ئەو دەست دەکات بە سڕینەوەی فایلە ئەسڵیەکانت وە لە جێگەی فایلی دروست دەکات وەکو خۆی بەڵام بە تشفیری ئەگەر تێبینی بکەن زۆربەی بەرنامەی کراکەکان لەکاتی کڕاککردن پێویست دەکات ئەنتی ڤایرۆس لە کار بخین بۆ ئەوەی کراکیان بکەین دوای ئەوەی ڤایرۆسەکە کاری خۆی کرد ئەوکات ئیتر ڕەزای ڤایرۆسەکەت پەکی دەکەوێت کارناکان  چۆن خۆمان بە پارێزین باشترین شت ئەوەیە کە ئەنتی ڤایرۆس لەسەر کۆمپیوتەرکەمان هەبێت بە بەردەوامی ئیش بکات هەروەها هەوڵ بدەن بەرنامەی اسڵی بەکار بەهێز نەوەک بەرنامەی کراک کراو ئەگەریش بەرنامەی کراک کراوتان بەکار هێنا ئەوا ئەو بەرنامانەی لە سایتە فارسیەکان هەیە زۆر بەی جار کاڕاکەکیان سەلامەت'),
    Technologya(
        technologyText:
            'سیستمی بەکارخەری\n\n بە ئینگلیزی (ئۆپەرێیتنگ سیستەم) کۆمەڵێک بەرنامەی بنەڕەتییە کە ئامێریک دەخاتە کار. واتە زاڵ ئەبێ بەسەر ڕەقەواڵەکانی ئەم ئامێرە و ڕاژەگەلێکی ھاوبەش دابین ئەکا بۆ بەرنامەی بەکاربەریەکان(ئەپلیکەیشن)، سیستمی بەکارخەری گرنگترین جۆری نەرمەواڵەی سیستمە لە ئامێرەکاندا، بۆ کرداری ڕەقەواڵەکان وەکو تێچوێنراو وە دەرچوێنراو وە بیرە تەرخانکردن، سیستمی بەکارخەری کاردەکا لە نێوانی ڕەقەواڵەکانی ئامێر و بەرنامەی بەکاربەریەکان،\n سیستمی بەکارخەری چەند بەشە\n\n سیستمی بەکار خەری کۆمپیوتەر وەکو ماک ئۆ ئێس، لینۆکس و ویندۆز\n\n سیستەمی بەکارخەری مۆبایل\n\n ئەندرۆید، ئای ئۆ ئێس و ویندۆز فۆن،   '),
    Technologya(
        technologyText:
            'لینۆکس\n\n سیستمێکە وەک ھەموو سیستمی کارپێکردنەکانی دی (ویندۆز، مەک ئۆ ئێس، نۆڤڵ، ھتد)، بەشێکی زۆری ئەم سیستمی کارپێکردنە بە پێوەری پازیکس ھاوئاھەنگ کراوە، بە شیوازی شارەزایانە لینوکس بە ناوکی سیستمی کارپێکردنەکە دەڵێن نە ھەموو، بەلام زۆر جار بۆ ئاسانی لە وتن، بەتەواو سیستمی کارگێڕییەکە دەڵێن لینوکس، کە لە سەرەتادا تەنھا وەک ئارەزوویەکی خوێندکارێکی لاو بەناوی لینوس تورڤالدسەوە کە لە زانکۆی ھێڵسینکی-فینلەندا دەیخوێند، دروست کرا، بوونی سروشتی دەستکەوتن و چالاکیی لینوکس وای کردووە کە ئەمڕۆ لە تەواوی جیھاندا ئاشنا بێت و زۆربەی پێشکەوتووخوازانی پرۆگرام سەرچاوەی یاساکەی بەکار دەھێنن بەپێی پێویستی خۆیان، لەم کاتەدا بە دەیان پرۆژەی بەردەوام ھەیە کە دەرگایان بۆ لینوکس کردۆتەوە بۆ ڕێکخستنی کاڵاڕەقەکان و مەبەستی جۆراوجۆر، لینوکس لۆگۆیەکی یاسایی‌ی ھەیە، پێنگوینی لینوکس کە لینوس تورڤالدس خۆی ھەڵیبژاردووە بۆ دەربڕینێک بۆ ئەو سیستمی کارپێکردنەی دروستی کرد '),
    Technologya(
        technologyText:
            'چەند زانیارییەک دەربارەی هەندێک لە دابەشکراوەکانی لینوکس\n\n  Ubuntu\n بە خۆڕاییە، سەرچاوە-کراویە و لەسەر دێبین بەندە، سێ جۆری هەیە دێسکتۆپ، سێرڤەر و کۆڕ،  هەرسێ جۆرەکە دەتوانن لەسەر کۆمپیوتەر و ڤێڕچوڵ مەشینیش کار بکەن، زۆرترین بەکارهێنەری هەیە لەچاو دابەشکراوەکانی دیکە و چەندین فلەیڤەری هەیە\n\n  Debian\n یەکێک لە کۆنترین سیستمی کارپێکردنەکانە کە لەسەر کێڕنڵی لینوکس بەند بێت، گووگڵ زۆر بەکاری دەهێنێتن چەندین سۆفتوێری خۆڕایی و سەرچاوە کراوەی تێدا بەکارهاتووە، \nبە Debian GNU/Linuxیش ناسراوە\n\n  Kubuntu\n فلەیڤەرێکی ئوبونتووە کە (کەی دی ئی) بەکاردەهێنێت وەک ژینگەی دێسکتۆپ\n\n   Xubuntu\n فلەیڤەرێکی ئوبونتووە کە (ئیکس ئێف سی ئی) بەکاردەهێنێت وەک ژینگەی دێسکتۆپ. زوبونتو واتە\n  XFCE + Ubuntu \n\n   Lubuntu\n فلەیڤەرێکی ئوبونتووە کە (ئێڵ ئێکس کیو تی) بەکاردەهێنێت وەک ژینگەی دێسکتۆپ لوبونتو واتە\n Lightweight Ubuntu \n\n  Ubuntu Studio \nفلەیڤەرێکی ئوبوتنووە کە تایبەتە بە خەڵکە کرییەیتڤەکان, چەندین سۆفتوێری بەنێوبانگی خۆڕاییی تێدایە بۆ ڤیدیۆ ئێدتتینگ، فۆتۆ ئێدیتینگ، ڕیکۆرد کردن، ئەنیمەیشن و هتد\n\n  Kali Linux\n لەلای خەڵک بە دابەشکراوی هاکینک ناسراوە، لەسەر دێبین بەندە،  پێشتر (گنۆمی) ی بەکاردەهێن،  زۆرتر بۆ هاکینگ بەکاردێت\n\n  Arch Linux\n یەکێک لەو دابەشکراوانەی کە دەتوانین زۆرترین دەستکاریی بکەین، پاکج مەنەیجەرەکەی (پاکمان)ە و باشترین دابەشکراوە بۆ پڕۆگرامینگ'),
    Technologya(
        technologyText:
            'ماک ئۆ ئێس\n\n  سیستەمێکی کارگێڕییە لەلایەن کۆمپانیای ئەپڵ پەرەی پێدەدرێت، بۆ یەکەمینجار لە ٢٤ی ئازاری ٢٠٠١ بەکارهات ئەمەش لەدوای وازهێنان لە ماک ئۆ ئێس و تائێستاش ئەپڵ بەردەوامە لە گەشەپێدانی، لەو ڕۆژەوەی کە ئەم سیستەمەیە دەرچووە سەرجەم مەکینتۆشەکان ئەم سیستەمەیان لەسەر دامەزرێنراوە کە لەزنجیرە خێزانی یونیکسە، پێشتر ئەم سیستەمە بەناوی مەک ئۆئێس ئێکس بوو بەڵام دوا بەدوای هاتنی وەشانی شێری شاخەکە (ماونتاین لایۆن) ناوی ئەم سیستەمە کارگێڕییە گۆڕدرا لە مەک ئۆئێس ئێکسەوە بۆ ئۆئێس ئێکس ئەوەش لەساڵی ٢٠١١ بوو'),
    Technologya(
        technologyText:
            'مایکرۆسۆفت ویندۆز\n\n سیستەمێکی بەگەڕخستنی ناخۆڕایە لەلایەن کۆمپانیای مایکرۆسۆفتەوە پەرەی پێدەدرێت، یەکەم ناسینی مایکرۆسۆفت بە ئەندامان سیستەمەکەی ناو نا (ویندۆز) لە تشرینی دووەمی ساڵی ١٩٨٥ وەک زیادکاریەک بۆ (مایکۆسۆفت دۆس) وەک\n وەڵامێک بەو گرنگیەی کە درا بە (گی یو ئای)، مایکرۆسۆفت وای لێھات کە دەسی گرت بەسەر کۆمپیوتەری تاکەکەسی لە جیھاندا وە تووانی بەسەر (ماک) ـدا تێپەڕ بێت، کە پێشتر بڵاو کرا بۆوە، نوێترین وەشانی بریتیە لە ویندۆز ١٠ وە نوێترین راژەکار بریتیە لە ویندۆز سێرڤەر ٢٠١٦ وە نوێترین وەشانی بریتیە لە سیستەمی مۆبایل ویندۆز ١٠ مۆبایل، ویندۆز ١٠ باشترین ویندۆزە کە تا ئێستا دروستکرابێت ئەم ویندۆزە سەراتە وەشانی تاقیکاری لێ دەرچوو بەڵام دوای ئەوە لەمانگی ٧ ساڵی ٢٠١٥ بە فەرمی بڵاو کرایەوە. ویندۆز ١٠ تێکەڵەیەکە لە ویندۆز ٧ و ٨٬١، شایەنی باسە ئەو ویندۆزە بۆ بەکارھێنەرانی ٧ و ٨٬١ بێ بەرامبەرە دەتوان نوێی بکنەوە'),
    Technologya(
        technologyText:
            'مایکرۆسۆفت\n\n کۆمپانیایەکی چەندنەتەوەییی تەکنۆلۆژیای کۆمپیوتەرە. گرینگترین بەرھەمەکانی سیستمی کارپێکردنی مایکرۆسۆفت ویندۆز و مایکرۆسۆفت ئۆفیسە. مایکرۆسۆفت لە ١٩٧٥دا دامەزراوە. مایکرۆسۆفت لە ساڵی ١٩٨٠کاندا (مایکڕۆسۆفت دو)ـی خستە بازاڕەوە کە بۆ بەکارھێنانی ماڵەوە بەکاردێت، کە لە دوای ئەویش (ویندۆزی ئێکس پی)ی دروست کرد'),
    Technologya(
        technologyText:
            'ئای بی ئێم\n\n مێژووی دروستبوونی (ئای بی ئێم) دە‌گە‌ڕێتە‌وە بۆ ساڵی ١٨٩٦ کە ھیرمان ھوڵیرت کۆمپانیایەکی بۆ وە‌بە‌رھێنانی ئامێری ژمێرکاری پێک ھێنا، ئەو ئامێرانە کاری ژماردنیان بەئەنجام دەگەیاند لە ڕێگای ئەو کارتە کونکراوانەی کە دراوەکان و زانیارییەکانی لەسەر بوون، ھەروەھا ئامێری دروست دەکرد کە لە سەرژمێری و دەنگداندا لە ئەمریکا بەکار دەچوون، ساڵی ١٩٢٤ ناوی ئەم کۆمپانیایە گۆڕدرا و کرا بە (ئای بی ئێم)، ئەو کاتە زۆر لە کارەکانی کۆمپانیاکە تایبەتمەند کرابوون بۆ ئامێرە بەکارچووەکانی کە لە دامەزراوەکاندا لە کاردا بوون، کاری وەکوو تاقیکاری، ڕیزکردن، کونکردنە ناو کارتەکانی کە بۆ نواندن و ھەڵگرتنی دراوەکان بەکار دەھێنران و ھتد'),
    Technologya(
        technologyText:
            'ئەپڵ\n\n کۆمپانیای ئەپڵ لە ١/٤/١٩٧٦ دا دامەزراوە لە ئەمریکا لە ناوچەی کالیفۆرنیا, ئەم کۆمپانیایە گەورەترین خزمەتی کردووە لە بواری کۆمپیوتەری کەسیدا، لە ساڵەکانی ١٩٧٠ دا زۆرترین ژمارە کۆمپیوتەری فرۆشتوە لە جیھاندا، لە سی ساڵی یەکەم ناوی کۆمپانیا تەنھا " کۆمپانیای ئەپڵ بۆ کۆمپیوتەری دیاریکراو " بوو ، بەڵام لە ساڵی ٢٠٠٧ وازی لەم ناوە ھێنا ئەمەش پاش ئەوە ھات کە کۆمپانیاکە کارەکانی فراوان کرد لە بواری ئەلکترۆنی ، لەگەل لاسایی کردنەوەی جۆرەکانی\n کۆمپیوتەری کەسی. کۆمپانیا نزیکەی ٣٥٠٠٠ فەرمانبەری ھەیە لە سەرتاسەری جیھان ، ڕێژەی فرۆشتنی لە ساڵی ڕابردوو ٣٢.٤٨ ملیار دۆلاری ئەمریکی بوو ، ساڵی ٢٠٠٨ کۆمپانیای ئەپڵ توانی ناوبانگێکی باش پەیدا بکات لە ڕووی کوالێتی بەرھەمەکانیەوە ئەمەش بە ھۆی جوانی لە دیزاینەکەی\n و ئەو رێکلامانەی کە بۆ بەرھەمەکانی ئەیانکات ، ھەروەھا کۆمپانیا کۆمەلێک فەرمانبەری لێھاتووی ھەیە لە بواری فرۆشتن و خستنە ڕووی بەرھەمەکان لەگەل بوونی لۆگۆیەکی بازری جوان،  گۆڤاری فۆرتیون کۆمپانیای ئەپڵی بە سەرنج ڕاکێشترین کۆمپانیا دەست نیشان کرد لە ویلایەتە یەکگرتووەکانی ئەمریکا لە ھەردوو ساڵی ٢٠٠٨ و ٢٠٠٩، ناوی ئەپڵ وشەیەکی ئینگلیزییە، کە لە کوردیدا بە واتای سێو دێ. کە ئەم ناوەش بەھۆی ئەوەوە ناونراوە کە ستیڤ جۆبسی خاوەنی پێشووی کۆمپانیای ئەپڵ لە کێڵگەیەکی سێوەوە گەڕاوەتەوە و وەکو چارەسەر سوودی لە سێو بینیوە ، ھەر لەبەر ئەوەش بە لایەوە ناوێکی سادە و جوان و خۆش بووە ڕوحیەتیکی تایبەتی ھەبووە ئیزعاج نەبووە. لێرەدا باسی سەفەرێکی ستیڤە بۆ کێڵگەیەک لە ھاویندا لە ویلایەتی کالیفۆرنیا، یەکەم لۆگۆی ئەپڵ لەلایەن (ڕۆن واین)ەوە نەخشێنرا کە وێنەی ئیساک نیوتۆن پیشاندەدات کە لە ژێر دار سێوێکدا دانیشتووە. پاشانیش (ڕۆب جانۆف) لۆگۆیەکی نوێی نەخشاند کە پێکھاتبوو لە سێوێکی ڕەنگاوڕەنگ. دواتر لە ساڵی (١٩٩٨ز) کاتیک کە کۆمپانیاکە بەرھەمی نوێی\n (ئای ماک)ی بەرھەمھێنا پێی باش بوو کە لۆگۆی کۆمپانیاکەش کەمێک سادەتر بێت ھەر لەبەر ئەوە لۆگۆی کۆمپانیاکە چەند جارێک بە ڕەنگی ڕەشی سادە دەردەکەوت و بەڵام بە شێوەیەکی ڕەسمی لە نێوان ساڵانی (٢٠٠١-٢٠٠٣) لۆگۆی کۆمپانیاکە گۆڕدرا بۆ سێوێکی ڕەشی سادە. لە دوای ساڵی (٢٠٠٣)وە بوو بە سێوێکی ئاوی یان ڕەساسی، تاکوو ساڵی ٢٠٠٦، کۆمپانیای ئەپڵ لە چەندین بواری (نەرمەکاڵا) و (ڕەقەکاڵا) دا دەستبەکارە، بەرھەمەکانی ئایفۆن، ئای ماک و ئای پۆد لە ھەموو بازاڕەکانی جیھاندا بڵاوە، ھەروەھا خاوەنی گەورەترین کۆگای مۆسیقا بەناوی (ئای تونس) کە چەندین ملیۆن گۆرانی و ئاوازی لەخۆ گرتووە، لە ‌بواری سیستەمی کارپێکردنیشدا (ماک ئۆ ئێس ئێکس)ـی ھەیە، ئەمیش وەک بەرھەمەکانی تری سەرکەوتووە '),
    Technologya(
        technologyText:
            'مەکینتۆش\n\n  زنجیرەیەکە پێک ھاتووە لە چەند ھێڵێک بۆ کۆمپیوتەرە کەسیەکان  نەخشەسازی و پێشکەوتنی لەلایەن کۆمپانیای ئەپڵەوە بۆ کراوە یەکەم ماکینتۆش بەرھەم ھێنرا لە ٢٤.١.١٩٨٤ ئەمەش یەکەم ئەزموونی سەرکەوتوو بوو کە بۆ کۆمپیوتەرە کەسیەکان کرا جگە لە ماوس و ڕووتەختە ئەلیکترۆنییەکان کۆمپانیاکە بەردەوام بوو لە سەرکەوتنە یەک لە دوای یەکەکانی بۆ نیوەی دووەمی ساڵی ھەشتاکان لە ساڵی نەوەدەکانش وردە وردە بەرەو کاڵبوونەوە و نەمان ڕۆشت وەکو مارکێتی کۆمپیوتەرە کەسییەکان، چەند ساڵێک دوای ئەوە کۆمپانیای ئەپڵ بە نموونەی جۆراوجۆر ھێنرایە بەردەستی کڕیاران لەلایەن ئای ماک لە ساڵی ١٩٩٨ لە پێشدا پارچەکان جیاواز و جوودا بوون بەڵام پێشکەوتنیان بەسەر ھێنا بە کۆکردنەوەیان بۆ ئامێرێک. ئەم بەرەو پێشچوونەش سەلمێنرا بە سەرکەوتنێکی تری ماکینتۆش. ئەم نموونە بەرچاوانە رووبەڕووی ماڵان و ناوەندی فێرکردن و کەسە پرۆفیشناڵەکان کرایەوە. ماک ئاسانە بۆ بەکارھێنان و جوانە لە دیزایندا و بەھێزە و ستایلێکی جوانی ھەیە، ھەموو ماکە تازەکان زۆر دابەزێنران لەگەڵ (ماک ئۆ ئێس ئێکس)ی سیستەمی کارپێکردن کە دیزاین و درووستکردنی لەلایەن کۆمپانیای ئەپڵ ھاوکاری کراوە'),
    Technologya(
        technologyText:
            'ئەپلیکەیشن\n\n ئەپلیکەیشن یا نەرمامێری بەکاربەری بەو نەرمامێریە ئەوترێ کە داڕێژراوە بۆ ئەوەی یارمەتیی بەکارھێنەرەکەی بدا لە بەئەنجامگەیاندنی کارێکی تایبەتدا، نموونەکان بریتین لە نەرمامێری ژمێریاری، نەرمامێری ڕێکخراوە، نەرمامێری نیگارەیی و میدیا پلەیێر، لە بنچینەدا زۆرێک لە ئەپلیکەیشەنەکان سەروکاریان لەگەڵ بەڵگەنامەیە. لەوانەیە ئەپلیکەیشنەکان لەگەڵ سیستمی بەکارخەریی کۆمپیوتەرەکە خرابێتن و لەوانەشە بەجیا بڵاو بکرێنەوە، ھەندێک لە بەکارھێنەران بەو ئەپلیکەیشنە لەگەڵخراوانە ڕازین و ھەرگیز ئەپلیکەیشنی تر دانامەزرێنن، نەرمامێری بەکاربەری لەگەڵ نەرمامێری سیستم و ناوینەواڵەدا جیاوازیی ھەیە، ئەوان توانایییەکانی کۆمپیوتەر ڕاستەخۆ بۆ بەجێھێنانی پێداویستییەکانی بەکارھێنەر ناگرنە کار، نەرمامێری سیستم کار بۆ ئەپلیکەیشن ئەکا، ئەپلیکەیشنیش کار بۆ بەکارھێنەر ئەکا'),
    Technologya(
        technologyText:
            'ئەندازیاری پێچەوانە چیە و کێیە؟\n\n ئەندازیاری پێچەوانە واتا گەڕاندنەوەی سیستەم و نەرمەکاڵاکان و ڕەقەکاڵاکان بۆ خاڵی سفر(سەرەتا)، ئەندازیاری پێچەوانە کەسێکە کە شارەزایەکی زۆری ھەیە و نەرمەکاڵاکان یان ڕەقەکاڵاکان شیتەڵ دەکات و شییان دەکاتەوە لە پێناو زۆر مەبەست و ئامانجی تایبەت، ئەندازیاری پێچەوانەی نەرمەکاڵاکان، سیستەمەکان و پڕۆگرام و ئەپڵیکەیشنەکان ھەڵدەوشێنن و شیتەڵیان دەکەن شیان دەکەنەوە دەیانگێڕنەوە سەر سۆرس و زمانە ئاست بەرزەکانی پڕۆگرامسازی، بە ئامانجی دۆزینەوەی ھەڵە لە سیستەمەکان و چارەسەرکردنی کێشەکان تا لەڕووی سیکوێریتیەوە دووربن لە کێشە یانیش بە ئامانجی زیان گەیاندن بە سیستەم و ئەپڵیکەیشنەکان، یان بردنی سۆرس کۆدەکان بۆ دووبارە دروستکردنەوە و داڕشتنەوەی سیستەم و ئەپڵیکەیشنەکان وەک خۆیان یان بە کەمێک دەستکاری کردنەوە واتا کۆپی ڕایت، کە ئەمەش پێشێلکردنی یاسایەو ئەندازیارانی پێچەوانە ڕووبەڕووی سزای یاسایی دەبنەوە، زۆر جار ئەندازیاری پێچەوانەی نەرمەکاڵاکان سیستەم و پڕۆگرامەکان شی دەکاتەوە بۆ دڵنیا بوون لە پاکی سیستەم و پڕۆگرامەکان کە ھەڵگری ھیچ ڤایرۆسێک نین، ئەندازیاری پێچەوانەی ڕەقە کاڵاکان کاریان شیکردنەوە و لێکدانەوە و لێکۆڵینەوەی پارچە ڕەقەکانە وەک (پرۆسێسەر، ڕام، ھارد درایڤ، مۆنیتەر)هتد، '),
    Technologya(
        technologyText:
            'نێوراڵ نێتۆرک\n\n  یەکێکە لە زانستەکانی زیرەک دەستکرد کە تیایدا ئەتوانی ڕۆبۆتی زۆر زیرەکی لێ دروست بکەیت و یەکێکە لە هەرە بەشە پڕ بایەخ پێ دراوەکان لەو زانستەیا'),
    Technologya(
        technologyText:
            'کۆمپانیای دێلل لە ساڵی ١٩٨٤ دامەزراوە لە لایان (مایکڵ دێلل) ئەمریکی'),
    Technologya(
        technologyText:
            ' تا ساڵی ٢٠٢٠ زیاتر لە ٣١ ملیار ئامێر پەیوەست بووە بە ئینتەرنێت'),
    Technologya(
        technologyText:
            ' لە ٨ مانگی یەکی ساڵی ١٩٤٠ بۆ یەکەم جار کۆمپیوتەری ئالۆزی (جۆرج ستیبیتز) بە فەرمی کاری پێکرا ، توانای ٤٠٠ بۆ ٤٥٠ کرداری باینەری هەبوو ، تەنها کرداری جاران و دابەشی ئەنجام دەدا'),
    Technologya(
        technologyText:
            'کۆمپانیای مۆتۆرۆلا بەداهێنەری ڕادیۆی ئۆتۆمۆبێل دادەنرێت'),
    Technologya(
        technologyText:
            'کۆمپانیای نۆکیا بە سێیەم گەورەترین کۆمپانیای پیشەسازی ئامێری نێتوۆرک دادەنرێت'),
    Technologya(
        technologyText:
            ' سامسۆنگ ٣٨ ساڵ و ١ مانگ لە کۆمپانیای ئەپڵ گەورەترە\n\n  ئەپڵ لە بەرواری ١٩٧٦/٤/١ دامەزراوە\n\n سامسۆنگ لە بەرواری ١٩٣٨/٣/١ دامەزراوە'),
    Technologya(
        technologyText:
            'فلۆپی دیسک\n\n فلۆپی جۆرێک بوو لە بیرگە کە لە توانایدا هەبوو داتای ئەلیکترۆنی هەلبگرێت وەک پەڕگە"فایل"یەکی کۆمپیوتەر یەکەم فلۆپی لە لایەن کۆمپانیای "ئای بی ئێم" ەوە لە ساڵی ١٩٦٧ دروستکرا وەک شوێنگرەوەیەکی درایڤە ڕەقەکان کە بۆ ئەوکات زۆر گرانبوون باوترین جۆری فلۆپی دیسکبوو توانای هەڵگرتنی ١.٤٤ مێگا بایت داتای هەبوو، واتە بە نزیکەیی توانای هەڵگرتنی تەنیا یەک وێنەی مۆبایلی هەبوو'),
    Technologya(
        technologyText:
            'یەکەم مەکینەی گەڕان لە ئەنتەرنێت مەکینەی ئەرشیە\n کە ساڵی ١٩٩٠ لەسەر دەستی کۆمەڵێک لێکۆڵەر دروست کرا'),
    Technologya(
      technologyText: 'یەکەم ڤایڕۆسی کۆمپیوتەر ناوی کریپەر بوو',
    ),
    Technologya(
        technologyText:
            'دۆگڵاس ئانگلبارت لە ساڵی ١٩٨٦ ماوسی کۆمپیوتەری داهێنا'),
    Technologya(
        technologyText:
            'یەکەم ئامێری تۆمارکردنی ڤیدیۆ بە کامێرا کە دروستکرا لە ساڵی ١٩٥٦ قەبارەکەی هێندەی پیانۆیەک دەبوو'),
    Technologya(
        technologyText:
            ' یەکەم مۆبایل کە دروست کرا ٩٠ رۆژی پێچوو ، وە دیزاینەکەی لەسەر بنچینەی پێشبڕکێیەک هەڵبژێردرا کە لە نێوان ئەندازیارانی کۆمپانیای مۆتورۆلا ئەنجام درابوو'),
    Technologya(
        technologyText:
            'توێژەرانی ئەمنی ئەلیکترۆنی و ھاککەران لە زانکۆی ئەلەباما لە ویلایەتە یەکگرتوەکانی ئەمریکا سەرکەوتووبون لە سیخوڕی کردن بەسەر شەپۆلەکانی مێشک، وە زانینی ژمارەی نھێنی یاخوود پاسۆردی بەکارھێنەران,کوورت و پووخت واتە دەتوانن مێشکی مروڤ ھاکک بکەن و ژمارە نھێنیەکانیان بزانن، لەراستیدا ێەم جۆرە ھاکک و تەکنیکە لە ساڵی ٢٠١٢ وەو ھەیە، بەڵام لە ساڵی ٢٠١٩ گەیشتە لووتکە و زۆر پەرەی پێدراوە '),
    Technologya(
        technologyText:
            'جون لۆجی بێرد زانای بە سکۆتلەندی یەکەم تەلەفزیۆنی دروست کرد'),
    Technologya(
        technologyText:
            'گابڕیاڵ لیپپ مان یەکەم کەس بوو کامێرای ڕەنگاو ڕەنگی داهێنا'),
    Technologya(technologyText: 'ئەرنس فێرمەر یەکەم بڵندگۆ(سپیکەر)ی داهێنا'),
    Technologya(technologyText: 'کریستۆفەر شۆڵێس بە داهێنەری کیبۆرد دادەنرێت'),
    Technologya(
        technologyText:
            'ئەلێساندەر ڤۆڵتا بە یەکەم داهێنەری پاتری ئەلکتڕۆنی دادەنرێت'),
    Technologya(technologyText: 'داهێنەری مانگی دەسکرد میخائیل تیخۆنڕاڤۆڤ بوو'),
    Technologya(
        technologyText:
            'ئایا دەزانی یەکەم وەشانی سیستەمی ویندۆز لە ساڵی ١٩٨٥ بڵاوکراوە کە ناوی\n Windows 1.0 '),
    Technologya(
        technologyText:
            'داهێنەری تۆڕی جاڵجالۆکەی جیهانی تیم بێرنێرس بوو \n (World Wide Web)'),
    Technologya(
        technologyText:
            ' یاریGTA V\n\n تەنها لە ٣ رۆژییەکەمدا بای زیاتر لە یەک ملیار دۆلار فرۆشی هەبوو و ھەتا کۆتای ٢٠١٩ سەرو ١٢٠ ملیۆن کۆپی لێ فرۆشرا '),
    Technologya(
        technologyText:
            'لە هەر خولەکێک لە یوتیوب ١٠٠ کاتژمێر ڤیدیۆ بار”ئەپلۆد” دەکرێت'),
    Technologya(technologyText: 'داهێنەری ڕادار ڕۆبەرت واتسۆن بوو '),
    Technologya(
        technologyText:
            ' داهێنەری مایكرۆسكۆبی ئەلکترۆنی هەردوو زانای\n ئەڵمانی (ئیڕنست روسکا) و (ماکس کنۆڵ) بوون'),
    Technologya(technologyText: 'داهێنەری لێزەر زانا (ثیۆدۆڕ مەیمان) بوو'),
    Technologya(
        technologyText:
            'دروستکەری یەکەمین بیرگە (هاڕد درایڤ) کۆمپانیایی ئای بی ئێم بوو '),
    Technologya(
        technologyText:
            'ئایا دەزانی داهێنەری مایکرۆفۆن زانا چارلس ويتستۆن بوو'),
    Technologya(technologyText: 'جۆرجی دیڤۆڵ داهێنەری یەکەمین ڕۆبۆت بوو'),
    Technologya(
        technologyText: 'داهێنەری کامێرای وێنە گرتنی خێرا ئدوین لاند بوو'),
    Technologya(technologyText: 'داهێنەری ئامێری ئاتاری نۆڵان بوشناڵ بوو'),
    Technologya(technologyText: ' داهێنەر چاپخانە یۆهانس گوتین بێرگ بوو'),
    Technologya(technologyText: 'داهێنەری (یو ئێس بی) ئاجای بهات بوو'),
    Technologya(
        technologyText: 'دروستکەری یەکەمین ئامێری یاری ڤیدیۆی رالف بایر بوو'),
    Technologya(
        technologyText:
            ' لە ساڵی ١٩٧٥ بێل گەیتس کۆمپانیای مایکرۆسۆفتی دامەزراند'),
    Technologya(
        technologyText: 'کۆمپانیایی ئای بی ئێم بە داهێنەری مەذەڕبۆڕد دادەنرێت'),
    Technologya(
        technologyText: 'لە ساڵی ٢٠١٠ کیڤن سیسترۆم ئینستگرامی دروست کرد'),
    Technologya(technologyText: 'لى بيۆنگ چول دامەزرێنەری کۆمپانیای سامسۆنگە'),
    Technologya(technologyText: 'دامەزرێنەری گوگڵ لاری پەیج و سێرجی برین بوو'),
    Technologya(
        technologyText: ' دامەزرێنەری کۆمپانیای ئای بی ئێم چارلس فلینت بوو'),
    Technologya(
        technologyText:
            ' لە ساڵی ٢٠٠٤ کۆمپانیای مۆزیلا یەکەم وەشانی\n وێب گەڕی فایەرفۆکسی بلاوکردەوە'),
    Technologya(
        technologyText:
            'لە سالی ١٩٨٣ یەکەم وەشانی مایکرۆسۆفت ویندۆوز ڕاگەیەندرا'),
    Technologya(
        technologyText:
            'ناوی راستەقینەی  ویندۆز لە ڕابردوو  ئینتەر فەیس مەنەجەر بوو'),
    Technologya(
        technologyText:
            ' جێف بێسۆز لە ساڵی ١٩٩٦ ‌کۆمپانیای ئەمەزۆنی دامەزراند'),
    Technologya(technologyText: ' ڕۆژانە ٣٠،٠٠٠ ماڵپەر هاک دەکرێت لە جیهان'),
    Technologya(
        technologyText:
            'یەکەم بەرهەمی کۆمپانیای ئەپڵ کۆمپیوتەری (ئەپڵ یەک) بوو کە لە ساڵی ١٩٧٦ بڵاویکردەوە، نرخی بەرهەمەکە ٦٦٦ دۆلار بوو'),
    Technologya(
        technologyText:
            'جی مەێل لە بەرواری ١/٤/٢٠٠٤ ڕاگەیەندرا, بەڵام زۆرێک لە خەڵکی پێیان وابووە کە گاڵتەبووە واتای ئەوەی گوگڵ راست ناکات'),
    Technologya(
        technologyText: 'لۆگۆی (فایەر فۆکس) ڕیوی نییە بەڵکوو پاندای سوورە'),
    Technologya(technologyText: 'لاری تێسەلەر بە داهێنەری کۆپی پەیست دادەنرێ '),
    Technologya(
        technologyText:
            'باکگراوندی ویندۆوز (ئێکس پی) وێنەیەکی راستییە لە ساڵی ١٩٩٦ پێنج ساڵ پێش ئەوەی کۆمپانیای مایکرۆسۆفت ویندۆز (ئێکس پی) ڕابگەیەنێت لەلایان فۆتۆگرافەر (چاڕلێس وۆڕیەر)، لە ویلایەتی کالیفۆڕنیا چڕکێندراوە '),
    Technologya(technologyText: 'لۆگۆی کۆمپانیای ئەپڵ سەرەتا زانا نیوتن بوو'),
    Technologya(
        technologyText:
            ' یەکەم وەشانی مایکڕۆسۆفتی وۆرد لە ساڵی ١٩٨٣ بڵاوکرایەوە'),
    Technologya(
        technologyText:
            'هواوی بە گەورەترین کۆمپانیای پیشەسازی ئامێری پەیوەندییەکان دادەنرێت'),
    Technologya(
        technologyText: 'ویلیام ئەدیسۆن بەدروستکەری گرافیک دیزاین دادەنرێت'),
    Technologya(
        technologyText:
            ' تاوەکو ئێستا گەورەترین بیرگەی(ئێس ئێس دی) کە دروست کرابێت لە ١٠٠ تێڕابایت تێپەڕ ناکات'),
    Technologya(
        technologyText:
            'لە ٢٧ نۆڤەمبەری ساڵی ١٩٩٨  نەوەی نوێ ئامێری یاری ڤیدیۆی سیگا لە وڵاتی یابان ڕاگەیەندرا'),
    Technologya(
        technologyText:
            'لە ساڵی ٢٠٠٧ کۆمپانیای گوگڵ سیستەمی وەگەڕخەری ئەندرۆیدی بڵاوکردەوە'),
    Technologya(
        technologyText:
            'لە ٥ دیسەمبەری ساڵی ١٩٦٥(ڕیچارد ویکسێلبلات) لە زانکۆی پەنسلڤینیا توانی نامەی دکتۆراكەی بە سەرکەوتووی تەواوبکات و لە دوای وەک یەکەم بڕوانامەی زانستی کۆمپیوتەر دانیپێدانرا'),
    Technologya(
        technologyText:
            'یەکەم مۆبایل کە سیستەمی ئەندرۆیدی لەسەر بوو بێت مۆبایلی (ئێچ تی سی دریم) بوو'),
    Technologya(technologyText: 'گووگڵ لە سەرەتا ناوی باکڕوب بوو'),
    Technologya(
        technologyText:
            'یەکەم پەیوەندی تەلەفۆنی بە مۆبایل لە ساڵی ١٩٧٣ بوو، پەیوەندیەکە لەلایەن (ماڕتین کوپەر)ەوە کرا'),
    Technologya(
        technologyText:
            'یەکەم مۆبایلی زیرەک ناوی سایمۆن بوو، پاڵپشتی کاتژمێر، بژمێر، نۆت پاد، ڕۆژ ژمێر، ئیمێل، هتد.. نرخی ١٠٠٠ دۆلار بوو'),
    Technologya(technologyText: 'بچوکترین یەکەی دیجیتەڵی بیتە'),
    Technologya(
        technologyText:
            'یەکەم کۆمپيوتەر کە وەک وۆرک ستەیشن بەکارهاتبێت (ئای بی ئێم ١٦٢٠) کە لە ساڵی ١٩٦٠ ناسێندراوە'),
    Technologya(
        technologyText:
            'کەی ڤایبەر دامەزرا ؟\n\n  ایبەر لە لایەن کۆمپانیای (ڤایبەر میدیا )ـوە گەشەی پێ ئەدرێت و ژماره‌ى به‌كارهێنه‌رانى ١ملیارى تێپه‌راندوه‌، سەرەتا کە ڤایبەر دروست کرا لەسەر مۆبایلی ئایفون بوو لە بەرواری ۲ـی دیسەمبەری ۲۰۱۰ـە بو تاکو ڕکابەری( سکایپ ) بکاتبۆ ئاندرۆید بەرواری ۲ـی ێۆلێو ـی ۲۰۱۱ـە بەردەست بو لە ماوەیەکی یەک جار کەم دا ٥۰ هەزار بەکار هێنەری تێپەڕان لەسەر سیستەمی ئاندرۆید'),
    Technologya(
        technologyText:
            'جیاوازی نێوان هاککەر و کراککەر چیه‌ ؟\n\n هاککەر\n بریتیە لەو کەسەی کە زۆر ئارەزووی چونە ناو کۆمپیوتەر و سیستەم و وێب و ئەلیککترۆنیات ئەکەن وە زۆربەی هاککەرەکان خۆیان پرۆگرامەرن واتا خۆیان پرۆگرام دادەڕێژن، واتا ئەو کەسانەی کە لای ئێمە خۆیان بەهاککەر ناساندوە لە ڕاستیدا هاکەر نین بەڵکو تەنها مشەخۆرێکن بەسەر پرۆگرامێکی هاککردنەوە .بەڵکو هاککەری راستی و بەتوانا ئەوەیە کە خۆی پرۆگرامی هاککردنەکە دادەرێژێت\n\n کراککەر \n بریتین لەکەسانەی کەوا سیتەمی بەرنامە یان پرۆگرامێک تێک دەشکێنن واتا بەشێوەیەکی نا یاسایی دەستکاری سیستەمی پرۆگرامێک یان بەرنامەیەک یان یارییەک دەکەن و گۆرانکاری تێا دەکەن، بەڵام ناتوانن دەستی بەسەرابگرن ،تەنها گۆرانکاری لەچەند بەشێکی دیاریکراو دەکەن'),
    Technologya(
        technologyText:
            'مەکینەی یونتی\n\n یونتی: نەرمەکاڵا (بەرنامە)یەکی ئاستبەرزی سێ رەهەندییە لەلایان (یونیتی تەکنەکۆژیا)ەوە پەرەی پێدەدرێت، یونتی بەکار دێت بۆ دروستکردنی یاری ٣ رەهەندی و ٢ رەهەندی و (ڤی ئاڕ) و فیلمی ئەنیمەیشن، یونتی ساڵی ٢٠٠٥ یەکەم وەشانی لێ بڵاوکراوەتەوە کۆتا وەشانیش لە مانگی یەکی\n\n ٢٠٢٠ بڵاوکرایەوە، وەشانی یەکەم تەنها لەسەر (ماک ئۆ ئێکس ئێسس) کاری دەکرد دواتر لە وەشەکانی تریدا بەردەستی کرد بۆ سیستەمی ویندۆوز و لینێکس'),
    Technologya(
        technologyText:
            'داخیلکردنی زمانی عەڕەبی بۆ کۆمپیوتەر\n\n لە ساڵی ١٩٧٤ لە جەزائیر ، و لە وەرزی ئەزموونەکانی بڕوانامەی بەکالۆریا یەکێك لە قوتابیەکان هەڵەیەکی لە هاوکێشەیەکی بیرکاری دۆزیەوە ، هەواڵەکە گەیشتە لیژنەی نیشتیمانی بۆ تاقیکردنەوەکان ، هەروەها سەرۆکی ئەو کاتی جەزائیر بەم باسە حەسا یەکسەر هەلیپکۆتەرێک تایبەت دەنێرێتە ماڵی ئەم قوتابیە و لە پایتەختی جەزائیر ئامادەی دەکەن ، قوتابیەکە بیردۆزی خۆی پێشکەش کرد و هەڵەی لیژنەی ئەزموونەکانی ڕاستکردەوە، ئەم قوتابیە لەلایەن سەرۆک "هواری بۆمدین" خەلات کرا و هەڵی خوێندنی لە وڵاتی یابان بۆ ڕاخسێنرا، ئەم قوتابیە ناوی (بەشیر حلمی)ــە ، ئەم قوتابیە زمانی عەرەبی داخیلی کۆمپتەری جیهان کرد'),
    Technologya(
        technologyText:
            'فۆتۆشۆپ\n\n  فۆتۆشۆپ نەرمەکاڵا (بەرنامە) یەکی ئاست بەرزی بواری گرافیکە، بۆ دروستکردن یان دەستکاریکردنی وێنە بەکاردێت،بە یەکێکە لە بەرھەمە سەرکەوتووەکانی کۆمپانیای ئەدۆب ئەژمارد دەکرێت،وەشانەکانی (سی) بۆ فۆتۆشۆپ لەساڵی ٢٠٠٣ ەوە بەردەوامن لە دەرچوون کە کۆتا وەشانی لە ساڵی ٢٠١٩ بڵاوبۆوە بەناوی (ئەدۆب فۆتۆشۆپ سی سی ٢٠٢٠) بوو، نەرمەواڵەکە پاڵپشتی ھەردوو سیستەمی کارپێکەری ویندۆزی مایکرۆسۆفت و ماک ئۆ ئێسی ئەپڵ دەکات، فۆتۆشۆپ سەرەتا تەنها بوو کاتێک لەساڵی ١٩٨٨ بەرھەمھێنرا لە لایەن دوو برای پرۆگرامەرەوە بەناوەکانی (جۆن کۆنڵڵ) و (تۆماس کنۆڵڵ) بەڵام دوای ئەوەی لەگەڵ کۆمپانیای ئەدۆبدا ڕێککەوتن و توانرا (فۆتۆشۆپ ١.٠) لەسەر کۆمپیوتەری ماکنتۆش جێگیربکەن لە ساڵی ١٩٩٠ دا ئەم بەرنامەیە لە ساڵی ١٩٩٢ دا بۆ سیستەمی مایکرۆسۆفتیش بەرنامە بنیات نراو لەو ڕێکەوتەوە تا ئێستا لە کاردایە'),
    Technologya(
        technologyText:
            'سیسته‌می ئای ئۆو ئێس چیە ؟\n\n به‌رهه‌می کۆمپانیای ئه‌پڵه‌و له‌ساڵی 2007 دا به‌رهه‌م هێنراوه‌ بۆ به‌گه‌ڕخستنی ئایفۆون ، ئه‌م سیسته‌مه‌ ته‌نها له‌ لایه‌ن کۆمپانیای ئه‌پڵه‌وه‌ به‌کار ده‌هێنرێت و به‌رهه‌مه‌کانی خۆی پێ پرۆگرام ڕێژ ده‌کات وه‌ک ( ئایفۆون و ئایپاد و ئایپۆود ) که‌ ناودارترین ئامێره‌کانی سه‌رده‌من به‌زمانی (ئۆبجێکتڤ سی، سی، سی پڵەس پڵەس)دارێژراوه‌ ، سیسته‌مه‌ی (ئای ئۆ ئێس) ئه‌گه‌ر چی سیسته‌مێکی زۆر به‌هێزه‌و تایبه‌تمه‌ندی ئێجگار به‌رزی تایبه‌ت به‌خۆی تێدایه‌ به‌ڵام ئه‌م سیسته‌مه‌ له‌لایه‌ن کۆمپانیای به‌رهه‌م هێنه‌ره‌وه‌ لۆک کراوه‌ له‌سه‌ر به‌رهه‌مه‌کانی ، ئه‌گه‌ر ئێستا ئایفۆون به‌ نمونه‌ وه‌ربگرین، ئایفۆون دوو جۆر له‌م سیسته‌مه‌ی له‌سه‌ر جێگیر ده‌کرێت جۆرێکیان که‌ (ئینتەرناشناڵ) که‌ له‌هه‌ر وڵاتێک بیت هه‌ر هێڵێکی گه‌یاندنی تێله‌فۆنی هه‌بێت بێ کێشه‌ له‌گه‌ڵیدا ده‌گونجێت و چالاک ده‌بێت ، به‌ڵام جۆری دووه‌میان لۆک ده‌کرێت له‌سه‌ر جۆرێک له‌ هێڵی تایبه‌ت بۆ نمونه‌ ئه‌و ئایفۆونه‌ی بۆ ئه‌مریکا به‌رهه‌م دێت له‌ وڵاتی خۆماندا هیچ سیمێک تیایدا به‌کار ناخرێت ، هه‌ر له‌به‌ر ئه‌م کاره‌ش بوه‌ به‌ نێچیری هاکه‌ره‌کان ڕۆژانه‌ به‌دوای هه‌ڵه‌یه‌کدا ده‌گه‌ڕێن له‌م سیسته‌مه‌ تا ئه‌و مافه‌ی له‌سه‌ر لابه‌رن ئه‌و کاره‌ش پێ ی ده‌وترێت جێڵبرێک واته‌ له‌ زیدان ئازادکردن ، دیاره‌ پاش جێڵبرێک کردن ئایفۆن وه‌ک هه‌ر ئینته‌رناشناڵێک له‌سه‌ر ته‌واوی سیمه‌کان چالاک ده‌بێت و له‌هه‌ر شوێنێکداو له‌هه‌ر وڵاتێکدا ده‌توانیت ئازادانه‌ مامه‌ڵه‌ی له‌گه‌ڵدا بکه‌یت ، ئای ئۆ ئێس بازاڕێکی گه‌وره‌ی فرۆشتنی به‌رنامه‌و یاری هه‌یه‌ که‌ ئه‌پڵ دایمه‌زراندوه‌ تا ئێستا ژماره‌یه‌کی ئێجگار زۆری به‌رنامه‌و یاری تێدایه‌'),
    Technologya(
        technologyText:
            'ئەندرۆید چییە؟\n\n  لە ساڵی ٢٠٠٣ لە کالیفۆرنیا لە ناوچەی (پالۆ ئالتۆ) دامەزرا، کاریان پەرەپێدان و بەرھەمھێنانی نەرمەکاڵا (بەرنامە) بوو بۆ ئامێری مۆبایل، نەخشەشیان ھەبوو کە سیستمێکی کارگێڕی برەو پێبدەن، لە ساڵی ٢٠٠٥ گووگڵ ئەم کۆمپانیایەی کڕییەوە، بەو ئامانجەی کە دەسەڵاتی خۆی لە بواری تەکنۆلۆژیای مۆبایلدا فراوان بکات، سیستمی کارگێڕی ئەندرۆید لە ساڵی ٢٠٠٨ بڵاوکرایەوە، لەو کاتەوە زۆر بەخێرایی گەشەی کردووە و بەرفراوانترین کۆمەڵەی پەرەپێدەری لە پشتەوەیە کە دەروبەری ٣٠٠٠٠٠ پڕۆگرامی بۆ دروست کراوە، مانای ووشەی ئەندرۆید، بە زمانی ئینگلیزی واتە رۆبۆتێک کە لە شێوەی مرۆڤ درووست کرابێت، '),
    Technologya(
        technologyText:
            'ڤایڕۆسی جۆپ چییە؟\n\n یەکێک لەو ڤایرۆسانەی کە لەم دواییەدا سەریهەڵداوە لە جۆرێکی ڕەنسۆموێرە، و لە خێزانی (دژاڤو) وە و پڕۆگرامەران و گەشەپێدەرانی بۆ چونە نێو سیستەمی کۆمپیتەرەکان دروستیانکردووە ناوی "جۆپ" ڤایرۆسە، هاککەران دەستدەگرن بەسەر هەرچی داتابەیس، پەڕگە(فایل)، وێنە و ڤیدیۆی ناو کۆمپیتەرەکەت هەیە و درێژکراوەی پەڕگەکان دەبن بە(دۆت جۆپ)، وە تاکە چارەسەری ئەوەی بتوانیت پەڕگە و وێنە وڤیدیۆکانت بهێنیتەوە پێدانی بڕی، ٤٩٠ دۆلار تا ٩٨٠ دۆلار، وە لەبەر ئەوەی زۆربەی هاککەرەکان کار بە بیتکۆین دەکەن ناچارت دەکەن بۆ ئەوەی پەڕگەکانت نەفەوتێن پارەکە بکەیت بە بیتکۆین ئینجا بۆیان بنێریت و ئەو توڵەی کە پێویستتە بۆ کردنەوەی پەڕگەکان هاککەرەکان بۆتی دەنێرنەوە سەرەڕای ئەوەش هەندێک\n هاککەر باوەڕیان پێناکرێت کە ئایا توڵەکە دەنێرن یان نا، چارەسەریش خۆپارستنە لەو بەرنامانەی کە کراک دەکرێن و دەخرێنە ناو سایتەکانەوە و هەر پەڕگەیەک یاخود بەرنامەیەکی کراککراو دادەنرێت بەبێ دڵنیابوونەوە نابێت بکرێتەوە '),
    Technologya(
        technologyText:
            'بڵێندەر\n\n  نەرمەکاڵا (بەرنامە)یەکی سەرچاوەکراوەی ئاستبەرزی بواری سێ رەهەندییە، لە لایان کۆمپانیای بڵێندەر دروست دەکرێت, بڵێندەر نەرمەکاڵایەکە بەکاردێت بۆ دروستکردنی کاری جیاجیا وەک کاری فیلم، ریکلامی تەلەڤیزیۆنی، یاری ڤیدیۆیی، بواری ئەندازیاری و پیشەسازی و دەسکاری کردنی ڤیدیۆو چەندان کاری جیاوازی تر، بڵێندەر لە ساڵی ١٩٩٤ لەدایکبووە وەکو نەرمەکاڵایەک و ساڵی ١٩٩٥ یەکەم وەشانی لێ بڵاوکرایەوە، یەکەم وەشانی نەرمەکاڵاکە لە ساڵی ١٩٩٥ بڵاوکراوەتەوە، کۆتا وەشانیش چەند رۆژێک بەر لە ئێستا بڵاوکرایەوە لەژێر ناوی(بڵێندەر ٢.٨٢)،بڵێندەر لە ساڵی ٢٠١٩ تەواو روکاری نەرمەکالاکەی گۆری بە شێوەیەکی باشتر لە جاران و ئاسانتر بۆ بەکارهێنەران، زیاد کردی دۆخی تاریک بۆ ڕووکاری نەرمەکالاکە و زیاد کرد (ریەڵ تایم رێندەر) و زیاد کردنی رێندەرکردن بە (گی پی یو) و (سی پی یو) و چەندان زیادکراویتر'),
    Technologya(
        technologyText:
            'هێرشی ئەلکترۆنی گۆماو(وۆتەر هۆڵ) چییە؟\n\n با بە نمونەیەک بێینە ناو باسەکە؛ ئەگەر لەسەرەتای سەرچاوەیەکەوە ئاوەکەی ژەهراوی بکرێت ئەو ئاوە بەتەواوی تا دەچێتە خوار ژەهراوی دەبێت و لە ئەگەری خواردنەوەی ژەهراوی دەبیت، هەمان کار کە هاککەرەکان دەیکەن ژەهراوی کردنی ئەو سەرچاوەیەیە کە تۆ سودی لێوەردەگریت، ئەویش بە بەکارهێنانی سەرچاوەیەک کە زۆرترین کەس سودی لێوەردەگرن\n\n چۆن؟\n تۆ لە کۆمپانییایەکدا ئیش دەکەیت کە زۆر ورد ئیش لەسەر تۆڕی ئینتەرنێتەکە کراوە و زۆر پارێزراوە و تەنانەت فلاشێکیشی لێنادرێت و هەموو کەسەکان پارێزراون، وە هاککەرێک دەیەوێت کارمەندێکی ئەو کۆمپانییا هاک بکات و دەشزانێت کە تۆڕی ئینتەرنێتەکەیان زۆر پارێزراوە، هەوڵدەدات بزانێت ئەم کەسە زیاتر سەردانی چ شوێنێک دەکات لە کافێ،کتێبخانە و یان تەنانەت چ بانکێک، حەز و خولیای چییە، و سەردانی چ سایتێک دەکات(کە ئەمەش شتێکی زەحمەت نیە نەزانرێت)،دواتر هەوڵ دەدات لە کاتێک ئەو سەردان دەکات ئەمیش لەوێبێت و فایلێک دەپێچێت بەو سایتەوە کە زۆرجار سەردانی دەکات، بە سەردانیکردنی کارمەندەکە خودکارانە فایلی پێچراو بەو سایتەوە دەچێتە ناو ئامێری بەکارهێنەرەوە و زانیارییەکانی دزە پێدەکات، ئەم جۆرە چونە ناوەوە کاتێک دەبێت کە پڕۆتۆکۆڵی ئینتەرنێتی هەردوو کەس لە یەک مەودا بن، بەمەش لەڕێگای کەسێکەوە دەتوانێت دزەبکاتە نێو ئامێری کەسەکانی کۆمپانیا کەشییەوە'),
    Technologya(
        technologyText:
            'ئەدۆبی ئیليستريتۆر\n\n ئەدۆبی ئیليستريتۆر نەرمەکاڵا (بەرنامە) یەکی ئاست بەرزی بواری گرافیکە بەکار دێت بۆ دروست کردنی لۆگۆ و پۆستەر و بنزسکارد و کاری هونەری و چەندەها کاری تر, ئیليسترەیتەر یەکەم وەشانی لە ساڵی ١٩٨٧ بوو، کە تەنها بۆ ماک ئۆ ئێس بوو کۆتا وەشانیشی ٢٠١٩ بوو بۆ هەموو پلاتفۆرمەکان، وەشانەکانی (سئ) ئیليسترەیتەر لەساڵی ٢٠٠٣ ەوە بەردەوامن لە دەرچوون کە کۆتا وەشانی لە ساڵی ٢٠١٩ بەناوی (ئەدۆبی ئیلیسترەیتۆر سی سی ٢٠٢٠) بڵاوبوویەوە، نەرمەواڵەکە پاڵپشتی ھەردوو سیستەمی کارپێکەری ویندۆزی مایکرۆسۆفت و ماک ئۆ ئێسی ئەپڵ دەکات، ئیليسترەیتەر زۆر باشترە لە فۆتۆشۆپ لە دروستکردنی کاری گرافیک و هێڵکاری هۆکارەکەشی ئەوەیە ئیليسترەیتەر لەسەر بنەمای (ڤیکتۆر) کاردەکات کە بە گەورەکردن و بچووککردنەوەی شێوەکان ڕوون(کوالێت)ی لەدەست نادات، لە کاتێکدا فۆتۆشۆپ لەسەربنەمای پێکسڵ کاردەکات ئەمەش وادەکات بە گەورەکردن یان بچووکردەوە ڕوون (کوالێت)ی خۆی لەدەست بدات'),
    Technologya(
        technologyText:
            'ئافتەرئیفێکت\n\n  نەرمەکاڵا (بەرنامە) یەکی ئاست بەرزی بواری (ڤی ئێف ئێکس) و موشن گرافیکە هەم ٢ دووری و هەمیش  ٣ دووری و دەسکاری کردنی ڤیدیۆ و فیلم، بە یەکێکە لە بەرھەمە سەرکەوتووەکانی کۆمپانیای ئەدۆب ئەژمارد دەکرێت، ئافتەر ئیفێکت یەکێکە لەو نەرمەکاڵایانەی کە ئەدۆبی شانازی پێوەدەکا کە خۆی دروستی کردووە و نەیکڕیوەتەوە ئافتەر ئیفێکت یەکەم وەشانی لەساڵی ١٩٩٣ بەرھەمھێنرا لە لایەن کۆمپانیای خودی ئەدۆبیەوە، وەشانەکانی (سی) ئافتەر ئیفێکت لەساڵی ٢٠٠٧ ەوە بەردەوامن لە دەرچوون کە کۆتا وەشانی لە ساڵی ٢٠١٩ بڵاوبۆوە بەناوی (ئەدۆبی ئافتەر ئیفێکت سی سی ٢٠٢٠) بوو، نەرمەواڵەکە پاڵپشتی ھەردوو سیستەمی کارپێکەری ویندۆزی مایکرۆسۆفت و ماک ئۆ ئێسی ئەپڵ دەکات'),
    Technologya(
        technologyText:
            'ئەدۆب ڕۆبۆهێڵپ\n\n توڵێکی تایبەتە بە کاری نوسینی سیستەمەکانی یارمەتی ئەلیکترۆنی و تایبەتر کاری تەکنیکی بۆ سەردانیکەرانی سیستەم و سایتەکان کاتێک پرسیار یان کێشەیەکیان بۆ دروستدەبێت، لەڕێی ئەم بەرنامەیەوە دەتوانیت سەنتەرێکی یارمەتی بۆ سیستەمەکان زیادبکەیت و ببێتە یارمەتیدەرێکی باش بۆ وەرگرتنی وەڵامێکی شایستە بۆیان، لەلایەن جین کیۆکاو و کۆمپانیای بلوسکایەوە لە بەفرانباری ١٩٩٢ یەکەم وەشانی دەرچووە، ناوی بلوسکای دواتر لە ساڵی ١٩٩٣بۆ ئیهێڵپ گۆڕدرا،لە کۆتاییدا و لە ساڵی ٢٠٠٥ بووبە بەشێک لە کۆبەرهەمەکانی کۆمپانیای ئەدۆب و لەو ڕێکەوتەوە وەشانەکانی لەژێر سەرپەرشتی کۆمپانیای بەناوبانگە، کۆتا وەشانی ڕۆبۆهێڵپ چەند تایبەتمەندییەکی بۆ زیادکراوە کە تێدا بەکارهێنەران دەتوانن (ئیچ تی ئێم ئێل) بەکاربهێنن و شێوازێک دروستبکەن کە لەگەڵ شاشەی هەموو ئامێرێکدا بگونجێت، لە وەشانەکانی پێشودا پێویستبوو کە بەرنامەکانی پرۆگرامسازی بزانیت وەک ڤیژوەڵ ستۆدیۆ،سی/سی پڵەس پڵەس و جاڤا یا جاڤا سکریپت بەڵام تایبەتمەندییە نوێیەکان وایکردووە کە تۆ بتوانیت دەستپێبکەیت بەبێ هەبوونی وەها ئەزموونێک، ئەم نەرمەکاڵا(سۆفتوێرە) یاخود توڵە زیاتر کارخانە پێشکەوتووەکان بەدوای دروستکردنی ناوەڕۆکی تەکنیکییەوەن بۆ بەکارهێنەرانیان بەکاریدەهێنن'),
    Technologya(
        technologyText:
            'ئەدۆبی لایت ڕووم\n\n  پڕۆگرامێکی ئەدۆبە کە تایبەتە بە ئیفێکت و جوان کردنی رەسم و درووستکردنی ئەلبوو ، چەندین فیلتەری تێدایە زیاتر فۆتۆگرافەکان ئەم پڕۆگرامە بەکار دێنن'),
    Technologya(
        technologyText:
            'ئەدۆبی پریمەر\n\n  پڕۆگرامێکی ئەدۆبە لەبواری مۆنتاژ دا بەکاردێت زۆربەی کەناڵەکان بۆ برین و چاکردنی ڤیدیۆ بەکاردێنن'),
    Technologya(
        technologyText:
            'ئەدۆبی ئین دیزاین\n\n  پڕۆگرامێکی ئەدۆبە بۆ دیزاینکردنیئەو بڵاوکراوانە بەکاردێت کە زۆرترین نووسینیان تێدایە و سلاید و رووکارەکانیان تێدایە زۆرە وەکگۆڤار و کتێب و نامیلکە'),
    Technologya(
        technologyText:
            'هاکی فیشینگ چییە؟\n\n فیشینگ جۆرێکە لە تاوانەکانە بڵاوەکان لە دنیای ئینتەرنێت کە شوێنێک یان چەند شوێنێک پەیوەندیان پێوە دەکرێت لە ڕێگەی ئیمەیڵ، تەلەفۆنییان بۆ دەکرێت یان لەڕێگەی کورتە نامەوە کە وا خۆیان دەردەخەن کە لە شوێنێکی فەرمییەوە یان ئەو بانک و شوێنەوەیە کە متمانەت پێی هەیە، و داوای زانیارییە تایبەتی و کەسییەکانت دەکەن وەک: وشە تێپەڕی بانکەکەت یان هەژماری تۆڕەکۆمەڵایەتتیەکانت، ئەمەش بۆ چارەسەرکردنی کێشەیەک یان دەڵێن بۆ پاراستنی هەژمارەکەت و پشکنین بۆی، دواتر زانیارییەکانت بەکاردەهێنێتەوە بۆ بۆ چونە ناو هەژمارەکانت بۆت دەردەکەوێت کە بە تەواوی دەستییان بەسەرئەژمارەی بانکی و تۆڕەکۆمەڵایەتییەکانتدا گرتووە، زۆرێک لە کەسە بەناو بانگەکان لە ڕێگای ئەم جۆرە هاکەوە زانیارییەکانیان دزەی پێدەکرێت'),
    Technologya(
        technologyText:
            'هێرشی دێنیەڵ ئۆف سێرڤز\n\n یەکێکە لە ڕێگاکانی هێرشی ئەلیکترۆنی کە بۆ وەستاندنی سەرچاوەی ماڵپەڕەکان بەکاردێت، وا دەکات بەکارهێنەر کە دەیەوێت بچێتە ناو ماڵپەڕەکەوە نەتوانێت سەرچاوەکانی ماڵپەڕەکە بەکاربهێنێت و وەستێنرابن، زۆربەی هاککەران ئێستا زۆر تیشک دەخەنە سەرئەم جۆرە هێرشە، دۆزینەوەی کەسی بەرپرسیار لەو هێرشە زۆر زەحمەتە لەبەر ئەوەی هێرشەکە لە هەموو شوێنێکەوە دەکرێت ڕێکبخرێت و ئەندازەگیری بۆ بکرێت، مێژووی ئەم هێرشە بۆ ساڵەکانی ١٩٧٤ دەگەڕێتەوە کە لە لایەن دەیڤد دێننیسی ١٣ ساڵانەوە ئەنجامدرا کاتێک بەرنامەیەکی داڕشت بە بەکارهێنانی فەرمانێکی دەرەکی(ئێکستێرناڵ کۆمماند) کە وای دەکرد ئەو کۆمپیوتەرانەی تاقیگەی لێکۆڵەرەوەکانی زانکۆکەی نزیکی بکوژێنەوە، ئێستا زۆر بەرەو پێشچوون و ئاڵۆزن لە ڕووی شێوازی هێرشەکەوە و دابەشبوونی جۆری هێرشەکە، گەورەترین هێرش تۆمارکرابێت لە ساڵی ٢٠١٨ بوو کاتێک هێرشیان کردوە سەر بنکەی خزمەتگوزاری کۆدەکانی ماڵپەڕی (گیت هەب) و بە پێی راگەیەندراوی فەرمی هێرشەکە ١.٣٥ تێرابایت لە چرکەیەک بووە\n\n بە گشتی لە دوو شێوەدا ئەم هێرشە خۆی دەبینێتەوە هەوڵدەدەین بە کورتی باسێکیان لێوە بکەین\n\n ١. هێرشی لافاوی\n ئەمە جۆرە باوەکەی هێرشی (دێنیەڵ سێرفز)ە، سیستەمەکە ڕێژەیەکی زۆری لافاو ئاسا داواکاری بۆ دێت کە ڕاژەکار(سێرڤەر) زۆربەی سەرچاوەکانی لە داتای هێرشەکەدا بەکاردەهێنێت و ئیدی سیستەمەکە خاودەبێتەوە توانای بەکارهێنانی سەرچاوەکانی نابێت لە داتا سەرەکیی و لە کۆتاییدا سیستەمەکە لە کار دەکەوێت، \n\n ٢. هێرشی لەکارخستن\n ئەم جۆرەیان زۆر کەم بەکاردێت کار لەسەر زۆری داواکەی لەسەر ڕاژەکار"سێرڤەر" ناکات و کار لەسەر داتاو فایلی هەڵخەڵەتێنەر دەکات، کاتێک تاوانبارەکانی سایبەر پڕۆگرمێکی گەشەپێدراو یان فایلێکی هەڵخەڵەتێنەر دەنێرن کە وا دەکات کەلێنەکان قۆرخ بکەن و لە ئەنجامدا سیستەمەکە لەکاردەکەوێت'),
    Technologya(
        technologyText: 'لە ساڵی ١٨٢٢ چارڵز بابیج یەکەم کۆمپیوتەری دروست کرد'),
    Technologya(
        technologyText:
            ' ڕوسیا لە ساڵی ١٩٣٦ کۆمپیوتەرێکی تایبەتی دروستکرد کە بە دڵۆپی ئاو کاری دەکرد'),
    Technologya(
        technologyText:
            'لە سالی 1925 بۆ یەکەم جار پەخشی راستەوخۆ بۆ تیڤی "television broadcast" کرا'),
    Technologya(
        technologyText:
            'تێلیگرام لە ساڵی ٢٠١٣ ژێر دەستی دوو برا بەناوی نیکۆڵای و پاڤێل دروستکرا'),
    Technologya(
        technologyText:
            'یەکەم کەس کە زاراوەی کۆمپیوتەری بەکارهێنا چارلێس باببئێیچ بوو'),
    Technologya(
        technologyText:
            'یەکەم گرافیک کاردی کۆمپانیای ئینڤیدیا ناوی Nvidia GeForce 256 بوو\n\n کە بەم شێوەیە بوو\n\n  ماکس ریزۆلیوشنی ٢٠٤٨ x ١٥٣٦ بوو \n ڕام کاد کڵؤک سپیدی٣٥٠ هێڕتز بوو \n ئەی پی ئای سەپۆڕتی : دایڕێکت ثری دی ، دایڕێکت درۆو ، دایڕێکت ئێكس ، ئۆپێن گی ئێڵ بوو'),
    Technologya(technologyText: '\tUSB\n\n Universal Serial Bus'),
    Technologya(technologyText: 'PDF\n\n Portable Document Format'),
    Technologya(
        technologyText: 'HDMI\n\n High-Defination Multimedia Interface'),
    Technologya(technologyText: 'DVD\n\n Digital Virsatile Disc'),
    Technologya(
        technologyText:
            'COMPUTER\n\n Common Operating Machine Particularly Used for Technical Education and Research'),
    Technologya(
        technologyText: 'DELL\n\n Development of Early Language Learning'),
    Technologya(technologyText: 'ATM\n\n Automated Teller Machine'),
    Technologya(technologyText: 'WLAN\n\n Wireless Local Area Network'),
    Technologya(
        technologyText: 'VIRUS\n\n Viral Information Reasearches Under Siege'),
    Technologya(technologyText: 'UPS\n\n Uninterruptible Power Supply'),
    Technologya(
        technologyText: 'IMEI\n\n International Mobile Equipment Identity '),
    Technologya(technologyText: 'LCD\n\n Liquid Crystal Display'),
    Technologya(technologyText: 'LED\n\n Light Emitting Diode'),
    Technologya(technologyText: 'HSPA\n\n High Speed Packet Access'),
    Technologya(technologyText: 'APN\n\n Access Power Name'),
    Technologya(
        technologyText:
            'WINDOWS\n\n Wide Interactive Network Development for Office Work Solution'),
    Technologya(technologyText: 'GSM\n\n Global System for Mobile'),
    Technologya(technologyText: 'GPS\n\n Global Positioning System'),
    Technologya(technologyText: 'WWW\n\n World Wide Web'),
    Technologya(technologyText: 'HTTP\n\n HyperText Transfer Protocol'),
    Technologya(technologyText: 'HTTPS\n\n Hypertext Transfer Protocol Secure'),
    Technologya(technologyText: 'HTML\n\n Hypertext Markup Language'),
    Technologya(technologyText: 'CSS\n\n Cascading Style Sheet'),
    Technologya(technologyText: 'PHP\n\n Personal Home Page'),
    Technologya(technologyText: 'SQL\n\n Structured Query Language'),
    Technologya(technologyText: 'QR\n\n Qiuck Response'),
    Technologya(technologyText: 'VPN\n\n virtual private network'),
    Technologya(technologyText: 'IP\n\n Internet Protocol'),
    Technologya(technologyText: 'PC\n\n Personal Computer'),
  ];
  void nextTech() {
    if (_techNumber < _techBank.length - 1) {
      _techNumber++;
    }
  }

  void previousTech() {
    if (_techNumber != 0) {
      _techNumber--;
    }
  }

  String getTechText() {
    return _techBank[_techNumber].technologyText;
  }

  bool isFinished() {
    if (_techNumber >= _techBank.length - 1) {
      print('Now returning true');
      return true;
    } else {
      return false;
    }
  }

  void reset() {
    _techNumber = 0;
  }
}
